[
  {
    "id": 0,
    "name": "Adriana Herden",
    "email": "herden@utfpr.edu.br",
    "area": "Engenharia de Software, Qualidade de Software, BPMN, BPMS, Robótica Educacional, Gerenciamento Ágil de Projetos Investigando o uso de planos iniciais juntamente aos testes exploratórios Contexto: O presente trabalho de conclusão de curso aborda assuntos relativos à testes exploratórios (TE) e suas formas de aplicação. Geralmente, durante a realização de TE não existe a obrigatoriedade de seguir um script, sendo este de livre navegação no software. Um desafio para usuários com baixa experiência em encontrar defeitos está relacionado a não ter um plano inicial para a execução dos TE. Objetivo: O objetivo principal deste trabalho é propor o uso de planos iniciais para os usuários com baixa experiência na execução de TE a fim de ajudar encontrar os defeitos no software. Método: O método proposto é composto de duas fases:(i) análise de aplicabilidade e identificação de abordagens alternativas para os planos iniciais junto aos TE e a (ii) aplicação de questionário com profissionais da área de testes a fim de observar a percepção sobre o uso de planos iniciais. Resultados Esperados: Espera-se que com as alternativas de planos iniciais mencionados neste trabalho, facilite o processo de execução de TE quando o usuário possui baixa experiência em testes. Qualidade de Software. Teste de Software. Teste Exploratório. Usabilidade em Robótica Educacional: Revisão Rápida Contexto: Revisão Rápida é um exemplo de estudo secundário. Este tipo de estudo sumariza evidências relacionadas a um tema em comum, porém antes de realizar uma revisão importante verificar a existência de estudos sobre o tema pretendido, evitando desperdı́cide tempo. Objetivo: O objetivo principal deste trabalho é realizar uma revisão rápida sobra usabilidade na área da robótica educacional. Método: A revisão rápida será dividida etrês etapas: (1) planejamento da revisão, (2) realização da revisão e (3) relatório da revisãoResultados Obtidos: Foram encontradas heurı́sticas especı́ficas para robótica educacionaldenominadas HEEDERSRobótica Educacional. Usabilidade. Heurı́sticas. Revisão Rápida. Demetra: Sistema de Controle Financeiro Para Produtores Rurais Nas últimas décadas, a tecnologia da informação deu um grande avanço, sendo implantada em diversos setores, movimentando bilhões por ano, do outro lado, o agronegócio movimenta trilhões ao ano, e mesmo assim, muitas propriedades ainda não possuem um sistema informati- zado para a gestão do seu negócio. Esse projeto foi idealizado pela necessidade do produtor rural em controlar e gerir seus custos de produção, que até então não refletia o verdadeiro estado financeiro da propriedade, devido a diversos fatores. O objetivo principal deste trabalho foi desenvolver um sistema que pudesse ser utilizado na gestão financeira do produtor rural, levando em consideração suas regras de negócio. Inicialmente, foi feito um levantamento de requisitos baseado nas regras de negócio da propriedade rural, em especial na financeira. Posteriormente, foi desenvolvido um projeto de software, até a fase final do desenvolvimento do sistema. Dentre os resultados obtidos pode-se destacar o desenvolvimento dos módulos, como o financeiro, o maquinário, a colheita e relatórios, além da integração dos mesmos, de forma que pode ser utilizado efetivamente na gestão da propriedade rural. Futuramente, espera-se oferecer um módulo de conversão de valores em reais para outras moedas e/ou quantidade de sacas de soja. Agronegócio, Sistema Web, Produção Rural, Controle Financeiro. Automatização da Atualização do Banco de Dados em um CMDB O CMDB tem como principal objetivo ser um repositório de informações relacionadas aos componentes dentro das organizações, devendo conter informações relevantes sobre estes equi- pamentos, porém para ser eficiente deve ser constantemente atualizado, e mostrar informações corretas sobre os itens, além disso, é necessário ter padrões bem definidos. Dessa forma, em diversas empresas esta atualização é feita de forma manual, com pouca padronização, o que acaba gerando uma série de erros e ou falhas técnicas, isso porque esse método está vulnerável a equı́vocos humanos. O objetivo deste trabalho é automatizar o processo de atualização de informações em um CMDB existente de uma empresa de soluções tecnológicas localizada no Brasil, facilitando o trabalho cotidiano e minimizando erros. Para atingir esse objetivo, foi desenvolvida uma automação que realiza as atualizações das informações dentro do banco de dados. Com a aplicação desta metodologia, foi desenvolvido um sistema que é executado de forma automática todas as semanas buscando atualizações nos componentes registrados, e quando houver discrepâncias o sistema realiza a atualização dentro CMDB seguindo os padrões determinados, evitando, dessa forma, que CMDB fique desatualizado. Ao adotar esta técnica no processo espera-se que se consiga manter os dados mais coerentes, e que haja uma diminuição das discrepâncias de dados, conseguindo, assim, tornar o CMDB numa ferramenta mais confiável e eficiente para que a empresa consiga utilizá-la na qualidade organizacional. CMDB. Qualidade Organizacional. ITIL. Padronização. Desenvolvimento de Sistemas Inovadores: emprego de Design Thinking, Métodos Ágeis e Experiência do Usuário no Processo de Desenvolvimento de Software O processo tradicional de desenvolvimento de sistemas computacionais e na Engenharia de Software frequentemente possui dificuldade de determinar as reais necessidades dos usuários, que acabam permanecendo em segundo plano. Atualmente, o surgimento das Startups têm revolucionado o processo de desenvolvimento de softwares por meio do uso de práticas ágeis e da imersão do usuário que permite reconhecimento de suas dores e a agregação de valor no processo de desenvolvimento de projeto. Nesse contexto, o objetivo deste trabalho acadêmico é identificar as abordagens, práticas e ferramentas utilizados pelas Startups para o desenvolvi- mento de softwares inovadores. Para alcançar esse objetivo, realizou-se uma busca sistemática sobre o assunto, assim como entrevistas em campo com empresas e Startups relacionadas com a incubadora da UTFPR-CP. A pesquisa permitiu identificar que as abordagens de Design Thinking (DT), Métodos Ágeis (MA) e Design de Experiência do Usuário (UX) no processo de desenvolvimento de software são citadas na literatura como práticas eficazes para o desen- volvimento de sistemas inovadores em Startups. Já a pesquisa em campo apresentou a adoção de práticas empregadas no desenvolvimento de softwares inovadores pelas Startups. A partir dos dados obtidos, foi possı́vel, comparar resultados da busca sistemática e a pesquisa de entre- vistas, fornecer insights para profissionais e empresas de tecnologia sobre as práticas e soluções para os desafios enfrentados durante o processo de desenvolvimento de sistemas inovadores. Como resultado, espera-se que o estudo auxilie as empresas e Startups de desenvolvimento de software a compreender as práticas, abordagens e ferramentas adotados, possibilitando que essas selecionem recursos da Design Thinking (DT) e de Design de Experiência do Usuário (UX) para agregar aos seus processos, incorporando assim o desenvolvimento centrado no usuário e aproveitando as práticas disponı́veis. Startups. Design Thinking. Métodos Ágeis. Design de Experiência do Usuário. UX Design INTEGRAÇÃO DE ANÁLISE DE RISCOS NO MODELO SCRUM: UM ESTUDO TERCIÁRIO A comunidade da Engenharia de Software e Gerenciamento de Projetos tem adotado a utilização de metodologias ágeis, das quais, Scrum, é uma das mais cotadas e frequentementescolhida frente à criação de um novo ciclo de vida no processo de produção de softwareIsso ocorre pois quando aplicado em sua totalidade, o Scrum pode trazer várias vantagenpara o desenvolvimento de um projeto, como: aumento de eficiência e produtividade, maiassertividade nos prazos de entrega, mais precisão nos custos do projeto e um contato muitmais ativo e produtivo com o cliente. Porém, dentro da definição do modelo Scrum, não existuma fase explı́cita que se proponha a analisar os riscos envolvidos em cada Sprint do projetosendo assim, nem todos os potenciais riscos à estrutura do projeto podem ser identificadosenquanto que, em outras abordagens como o modelo Espiral, existem fases explı́citas para lidacom essas situações, no caso, para cada iteração da espiral, apresenta uma Análise de RiscosSendo assim, este trabalho apresenta um Estudo Terciário realizado para sumarizar os trabalhosistemáticos que mostram como é feita a integração da Análise de Riscos no modelo ScrumE, para que se conhecesse mais profundamente os estudos secundários analisados, o EstudTerciário foi complementado pela aplicação da técnica de busca Snowballing. Assim, verificou-sque dos 14 trabalhos selecionados, aproximadamente 43% aplicou a integração na fase de SprinPlanning. Além disso, os processos de Gerenciamento de Riscos integrados, foram baseadoem conceitos trazidos das metodologias tradicionais e adaptados ao Scrum, o que resultona criação de novos guias, modelos e frameworks, que foram propostos e validados pelos autoresScrum. Análise de Risco. Snowballing. Estudo Terciário. "
  },
  {
    "id": 1,
    "name": "Adriane Carla Anastácio da Silva",
    "email": "anastacio@utfpr.edu.br",
    "area": "Engenharia de Software, Informática na Educação"
  },
  {
    "id": 2,
    "name": "Adriano Rivolli",
    "email": "rivolli@utfpr.edu.br",
    "area": "Aprendizado de Máquina, Inteligência Artificial, Meta-aprendizado, Ferramentas jurídicas, Ferramentas para o mercado financeiro de ações, Sistemas de informação interativo e educativos Gerenciador de datasets com visualização gráfica de meta-features utilizando o mfe Com a preocupação de se extrair a melhor solução em algoritmos de aprendizado de máquina, diversos estudos levantaram a questão de como identificar quais são as alternativas de caracterização que podem revelar diferentes resultados relevantes dentro de um conjunto de dados. Para solucionar esse problema, o Meta Feature Extractor (MFE), um software de extração de meta-features, pode ser utilizado, porém seu uso implica no conhecimento em linguagem de programação, tornando-o complexo e sendo necessário passar por uma alta curva de aprendizado por meio de tentativas e erros. O objetivo deste trabalho é a construção de uma ferramenta capaz de remover essa dependência do usuário e tornar seu uso mais fácil e intuitivo. Para isso, foi desenvolvido um sistema composto por uma página Web, para visualização e manipulação dos datasets e um servidor, aplicando as técnicas de arquitetura limpa, para tratamento das requisições do usuário e processamento dos dados por meio do MFE. Como resultado, foi obtido um software com uma interface simples e que requer pouca instrução para seu uso, que permite gerenciar datasets do tipo ARFF e disponibiliza uma visualização gráfica comparativa a partir dos resultados obtidos do MFE. A aplicação da arquitetura de micro serviços e dos princípios SOLID e arquitetura limpa durante o desenvolvimento do software o tornou uma solução de fácil manutenção e extensão. Para aperfeiçoamento do software, foi sugerido para trabalhos futuros a implementação de uma funcionalidade que permita a seleção do tipo de extração de dados e também o uso de tecnologias como Docker e Kubernetes para melhorar a robustez do sistema. MFE. Meta-feature. Gerenciador de dataset. Arquitetura de software.  ESTUDO COMPARATIVO ENTRE ANGULAR, VUE.JS E REACT.JS PARA DESENVOLVIMENTO DE APLICAÇÕES WEB FRONT-END O desenvolvimento de aplicações web tem hoje várias opções de frameworks e bibliotecas para auxiliar no desenvolvimento. No entanto, devido a grande quantidade de opções é comum surgir dúvidas sobre qual tecnologia escolher. Este trabalho compara as principais tecnologias para o desenvolvimento front-end, sendo elas os frameworks Angular e Vue.js e a biblioteca React.js com o intuito de ser um guia para desenvolvedores escolherem a tecnologia que melhor atende às necessidades e expectativas de seus projetos. Para tanto, após uma breve introdução sobre cada framework, suas caracterı́sticas foram analisadas, de modo especial a sintaxe e a arquitetura. Em seguida foi realizada uma análise comparativa entre elas. Sendo comparados aspectos gerais, como popularidade, mercado de trabalho e volume de utilizações, e aspectos técnicos, como sintaxe e performance, e por fim foi realizada uma comparação de desempenho utilizando uma mesma aplicação desenvolvida utilizando cada uma das tecnologias. Frameworks front-end; Angular ; React; React.js; Vue; Vue.js; Análise Com- parativa. JUDGECODE – Sistema web para questões de programação A avaliação formativa é essencial para a regularização do que é aprendido pelos alunos e para que o professor tenha um feedback de como os alunos estão reagindo aos seus meios de ensino. Apesar disso, essa prática demanda muito tempo, visto que para verificação constante do conteúdo é necessário que o professor monte listas e provas periodicamente. Embora existam soluções que auxiliem na resolução deste problema, como por exemplo gerenciadores de formulários genéricos, é necessário oferecer aos professores uma maneira simples e rápida de criar formulários especı́ficos para programação. Este documento apresenta o desenvolvimento de uma aplicação WEB que tem por objetivo auxiliar o professor no acompanhamento parcial do ensino à programação e suas tecnologias. Uma aplicação que permita os professores criarem questões especı́ficas para programação e salvarem em um banco de questões compartilhado, em que todos os professores terão acesso, possibilitando que usem as questões em suas próprias listas de exercı́cios. Agilizando assim o processo avaliativo. Sistema WEB. Banco de questões. Avaliação formativa. Um Sistema Web Para Gerenciamento de Clı́nicas Médicas de Pequeno Porte É comum que clı́nicas médicas, em especial as pequenas empresas, utilizem formas pouco eficazes para armazenamento e gestão de dados de seus pacientes, consultas e convênios médicos. Em alguns casos, a gestão ainda é feita de forma totalmente manual. A automatização de atividades como estas pode trazer muitos benefı́cios para estes negócios, pois torna a gestão mais segura e eficaz, além de implementar uma padronização das tarefas. Diante disso, este trabalho tem como objetivo apresentar o desenvolvimento de um sistema cuja finalidade é facilitar e melhorar, de forma geral, a gestão de clı́nicas médicas de pequeno porte, agilizando e tornando ainda mais organizado o trabalho dos funcionários envolvidos. O sistema desenvolvido conta com funcionalidades que permitem gerir relatórios, dados de consulta, convênios e pacientes. Em seu desenvolvimento foi utilizada a linguagem JavaScript e alguns de seus frameworks, como ReactJS e AdonisJS, além da utilização de um banco de dados relacional e de uma abordagem incremental de desenvolvimento de software. Clı́nica. Sistemas médicos. Desenvolvimento web. Software as a Service. Softwares de Gestão. PROTÓTIPO DE FERRAMENTA MODULAR INTERATIVA PARA ENSINO E APRENDIZADO DE ESTRUTURAS DE DADOS O estudo de Estruturas de Dados e algoritmos é importante para a formação na área da Ciência de Computação. Contudo, existem casos onde essa disciplina se torna um obstáculo para aqueles que a estudam, e apenas estudos teóricos não são suficientes para fazer com que o entendimento seja satisfatório. Ferramentas interativas podem ser um facilitador para aqueles que possuem dificuldades na compreensão do conteúdo. Diante disso, o presente trabalho visa desenvolver uma arquitetura de software para uma ferramenta de ensino e aprendizado de Estruturas de Dados que seja modular, e possibilite a adição de novas estruturas e recursos. Para alcançar esse objetivo, no trabalho foi implementado uma aplicação web seguindo os padrões da Arquitetura Limpa. Além disso, a componentização foi empregada por meio de biblioteca React, que possibilita a construção de componentes independentes entre si. Tudo isso, somado a uma abordagem incremental de desenvolvimento de software, tornou possı́vel que o programa seja completamente modular. Por fim, foi implementado um protótipo funcional de uma plataforma para visualização de Estruturas de Dados que possibilita executar seus algoritmos alterando os parâmetros de entrada. Isso validou a implementação da arquitetura escolhida, comprovando sua modularidade. Estruturas de Dados. Ferramenta de ensino. Arquitetura de Software. Aplicação Web. Sistema Modular."
  },
  {
    "id": 3,
    "name": "Alessandro Silveira Duarte",
    "email": "duarte@utfpr.edu.br",
    "area": "Engenharia de Software Sistema de Gerenciamento Nutricional Considerando o crescente número de doenças relacionadas a má alimentação, é perceptível a necessidade de oferecer softwares que possam auxiliar a interação entre pacientes e nutricionistas. Este trabalho teve como objetivo construir um sistema que permitisse aos nutricionistas criar dietas alimentares, definindo refeições e alimentos para os pacientes, e utilizar a classificação de alimentos denominada NOVA. O software desenvolvido trata-se de um Website, implementado utilizando principalmente a linguagem de programação Java e TypeScript, aliados aos frameworks de desenvolvimento de código Springboot e React. A metodologia de desenvolvimento utilizada foi o Scrum Solo, pois considera-se que esta oferece um bom suporte a equipes reduzidar ou de um único desenvolvedor. Website, Springboot, React, NOVA, Dieta."
  },
  {
    "id": 4,
    "name": "Alexandre LErario",
    "email": "alerario@utfpr.edu.br",
    "area": "Desenvolvimento Distribuído, Crowdsourcing, Manutenção de Software, Gestão de Projetos"
  },
  {
    "id": 5,
    "name": "Alexandre Rômolo Moreira Feitosa",
    "email": "alexandrefeitosa@utfpr.edu.br",
    "area": "Desenvolvimento de Software, Programação para Dispositivos Móveis, Informática na Educação, Tutores Inteligentes APLICATIVO ANDROID PARA GESTÃO DE RESERVA DE AMBIENTES UTILIZANDO FIREBASE O trabalho apresentado neste documento visa possibilitar uma aplicação Android, onde através dessa as reservas de espaço fı́sico realizadas na UTFPR de Cornélio Procópio possam ser feitas com funcionalidades que a diferencie positivamente em relação ao que é efetuado atualmente pela plataforma oficial. De modo que isto aconteça, buscou-se apresentar funcionalidades que melhor gerenciem o processo de reserva, tais como: aprovação automática de reserva baseada no perfil do utilizador, solicitação de reserva com horário flexı́vel, cancelamento de reserva após autorização e notificações sobre a situação da reserva. Para isto, idealizou-se a implementação do sistema como um aplicativo para dispositivo móvel, na plataforma Android. A abundância de aparelhos executando esse sistema operacional, aliado com as particularidades dessa plataforma, possibilitam uma execução mais apropriada e abrangente para a atividade de agendamento. Neste documento, apresenta-se o desenvolvimento do sistema idealizado, uma análise de sistemas relacionados, o processo, tecnologias e ferramentas utilizadas durante a implementação do aplicativo. Reservas, Android, Dispositivos móveis, Aplicativo, Android. Aplicativo móvel Android utilizando o Realtime Database para monitoramento de treinos para eSports Assim como nos esportes tradicionais, os profissionais de esportes eletrônicos precisam treinar diariamente para melhorar seu desempenho. Neste trabalho foi desenvolvido uma aplicação Android para auxiliar a criação de uma rotina de treinos para esses jogadores, através de planos de treinos, atividades planejadas, estatı́sticas e metas. E também, serão discutidas as tecnologias utilizadas, como o Java, o Android Studio e o Realtime Database, a análise de sistemas relacionados, as funcionalidades do aplicativo e o processo de desenvolvimento, incluindo uma visão geral da aplicação móvel. Esportes eletrônicos. Treino. Android. Dispositivos móveis. eSports. Aplicativo. ANÁLISE DE MÉTRICAS PARA ESCOLHA DO ALGORITMO DE CLASSIFICAÇÃO DE CLIENTES EM ABANDONO (CHURN) Com a popularização e o desenvolvimento das ferramentas de armazenamento e manipulação de dados, permitiu-se que o uso dos conceitos de machine learning não ficassem apenas no mundo acadêmico, mas também no mundo dos negócios. Os dados têm sido um grande aliado para as empresas conseguirem alavancar cada vez mais os negócios evitando, por exemplo, perderem os seus clientes, ou seja, que se tenha o aumento do número de clientes em churn. Sabendo disso, o trabalho apresentado tem como objetivo apresentar a análise e o processo percorrido para escolher o melhor algoritmo de classificação na detecção de clientes que entraram em churn (ou seja, abandonaram o produto) antes dos 90 dias sem a utilização do cartão, que é a regra utilizada em uma empresa emissora de cartão de crédito, tratada neste trabalho. O trabalho resultou que, levando em consideração as métricas de f1-score e recall, além do tempo de execução, o melhor algoritmo, é o Ada Boost, dentre quatro algoritmos testados no presente trabalho, pois apresentou 0.99 de f1-score e Recall, e tempo de execução igual a aproximadamente 64,2 segundos. Aprendizado de Máquina. Scikit-learn. Métricas. Churn. Classificação. SISTEMA DE MONITORAMENTO DE PROCESSOS JUDICIAIS E CONTROLE DE PRAZOS UTILIZANDO JAVASCRIPT, NODE.JS E A API ESCAVADOR A migração dos processos judiciais para o meio eletrônico somados a uma maior demanda por produtividade nos escritórios de advocacia gerou uma necessidade de implementação de novos métodos de resolução de problemas importantes ao exercı́cio da atividade, tais como o controle de prazos e o monitoramento de processos judiciais. Tanto o poder público quanto o setor privado passaram a investir em soluções tecnológicas que buscassem facilitar tais atividades, através de sistemas que controlam de forma precisa os prazos processuais e centralizam os acompanhamentos de processos, que antes eram realizados em sites de diferentes tribunais. Este trabalho tem como objetivo propor e validar o desenvolvimento de uma ferramenta de automatização do fluxo de trabalho de um operador do Direito facilitando tais atividades repetitivas e diárias, através da implementação de um sistema web utilizando de tecnologias como JavaScript e Node.js, consumindo dados provenientes dos Tribunais do Brasil utilizando da Application Programming Interface (API) judicial Escavador. A principal contribuição deste trabalho foi apresentar um protótipo funcional de um sistema web para monitoramento de processos judiciais e controle de prazos que consome dados de tribunais do Brasil através da API Escavador. Sistemas Web. Software Jurı́dico. Monitoramento de Processos."
  },
  {
    "id": 6,
    "name": "Alexandre Rossi Paschoal",
    "email": "paschoal@utfpr.edu.br ",
    "area": "Bioinformática, Jogos, Banco de Dados, Aprendizado de Máquina, Desenvolvimento Web, Ferramentas ANALISTA DE RPA Robotic Process Automation (RPA) é uma tecnologia que utiliza softwares robôs para automatizar tarefas repetitivas baseadas em regras, capaz de imitar interações humanas em sistemadigitais, ajudando na eficiência, no gerenciamento de erros e liberando recursos humanos partarefas não repetitivas. Um software para desenvolvimento em RPA é o Blue Prism, umplataforma que combina automação, inteligência artificial e análise avançada para soluçõede automação. A função de analista de RPA em uma equipe de sustentação e monitoria drobôs é garantir que os robôs em sustentação estejam funcionando corretamente de acordcom seu escopo inicial em ambiente produtivo, assim como realizar modificações necessáriapara otimização e melhorias do robô, conforme necessidade do cliente. Para isso, é utilizado sistema de gerenciamento de TI Service Now, que proporciona todas as ferramentas parcomunicação com cliente e documentação de todos os processos realizados na sustentação dsoluções de RPA. Este documento expõe as principais funções do dia-a-dia como analista dRPA na empresa EY, com demonstração de caso realRPA. Analista. Automação. Robô. Monitoramento. APLICATIVO PARA VISUALIZAÇÃO DE METADADOS DE ARTIGOS CIENTÍFICOS A visualização de dados pode ser uma grande aliada para conseguirmos entender como os dados se relacionam de uma maneira visual e inteligı́vel. Humanos tem usado formas de representações visuais desde as pinturas rupestres, até mapas, imagens e gráficos, pela sua facilidade de ser assimilada mais rapidamente do que caracteres em uma frase. Apesar de existirem muitas opções de visualizadores de metadados de artigos cientı́ficos, a maioria é voltada para sistemas desktop, tanto aplicativos quanto na web, utilizando navegadores em telas grandes e processadores poderosos, entretanto, existem poucas opções para dispositivos móveis. Nesse projeto, foi relatado o desenvolvimento de um aplicativo Android, voltado para simplicidade e facilidade de uso, que gera gráficos analisando metadados de artigos cientı́ficos e mostra os resultados de forma gráfica. Visualização de dados. Metadados. Artigos cientı́ficos. Mobile."
  },
  {
    "id": 7,
    "name": "André Luis dos Santos Domingues",
    "email": "anddomingues@utfpr.edu.br",
    "area": "Engenharia de Software"
  },
  {
    "id": 8,
    "name": "André Luiz Przybysz",
    "email": "andrelp@utfpr.edu.br",
    "area": "Desenvolvimento de Software, Desenvolvimento de Novos Produtos, Desenvolvimento Sustentável (ODS), Ferramentas de Tomada de Decisão, Cidades Inteligentes, Engenharia de Software DESENVOLVIMENTO DE UMA FERRAMENTA PARA MONITORAR REST APIs O DevOps é um conceito criado para se definir uma cultura de práticas e ferramentas que são adotadas por empresas a fim melhorar a produtividade dos times de desenvolvi- mento e, também, aumentar a disponibilidade de suas aplicações. Algumas destas técnicas são usadas durante o período de o desenvolvimento de um software, os como Testes Auto- matizados e Integração Contínua. Já outras são usadas depois que o software é enviado para Produção, como a configuração da infraestrutura e o monitoramento, o qual é o objeto de estudo deste trabalho. A identificação e notificação ágil da indisponibilidade em uma aplicação, permite a atuação quase imediata dos mantenedores do sistema. Reduzindo os impactos negativos causados por degradações de um sistema e seus subsistemas. Para isso, empresas utilizam diversas ferramentas que as auxiliam a monitorar os componentes, desde a camada física, o hardware, passando pela infraestrutura, como redes de compu- tadores e chegando até a camada de aplicação, que é quem de fato necessita de uma alta disponibilidade. Desta forma, o intuito deste trabalho é auxiliar no monitoramento de aplicações do tipo REST APIs, oferecendo uma ferramenta que consiga informar a situação de uma aplicação. Para isso, a ferramenta desenvolvida neste trabalho, envia requisições reais para o sistema de produção e através da resposta, verifica a situação do sistema e, em caso de falhas, alerta imediatamente os seus mantenedores. Além disto, a ferramenta oferece uma opção, por meio da qual uma aplicação pode se associar a outras aplicações já inseridas na ferramenta, para que assim seja possível definir dependências diretas. Sendo assim caso haja falha em uma de suas dependências, ela também irá ser notificada. API RESTful. Monitoramento. Monitoramento Semântico. Monitoramento Sintético. Aplicações Distribuídas."
  },
  {
    "id": 9,
    "name": "André Yoshiaki Kashiwabara",
    "email": "kashiwabara@utfpr.edu.br",
    "area": "Bioinformática, Reconhecimento de Padrão, Computação Musical, Inteligência Artificial, Teoria da Computação"
  },
  {
    "id": 10,
    "name": "Antonio Carlos Fernandes da Silva",
    "email": "antonio@utfpr.edu.br",
    "area": "Gerenciamento e Projeto de Redes, Arquiteturas de Hardware, Desenvolvimento hardware / Software (arduino, raspberry, UDO, Etc..), Desenvolvimento com FPGAs, Compilação para Hardware DESENVOLVIMENTO DE UM BRAÇO ROBÓTICO UTILIZANDO MICROCONTROLADOR ESP8266 CONTROLADO VIA WI-FI Os robôs industriais são amplamente empregados por se adaptarem as necessidades especı́ficas das tarefas a serem realizadas, por meio de movimentos programados e o uso de garras e ferramentas selecionadas. O investimento crescente em robôs industriais é impulsionado pela demanda por sistemas altamente automatizados e dinâmicos na indústria. Além de substituir os humanos em atividades perigosas e monótonas, os robôs também reduzem custos e melhoram a qualidade dos produtos fabricados. Um braço robótico é um dispositivo programável que imita as funções de um braço humano, proporcionando precisão, repetibilidade e força. Os microcontroladores desempenham um papel fundamental no controle e processamento de dados na robótica, sendo essenciais para o movimento e interação dos robôs. Este trabalho propõe o desenvolvimento de controle de um braço robótico via Wi-Fi, utilizando um microcontrolador, através de uma interface web. Visando a aplicação de robôs cooperativos na indústria e a manipulação de objetos por comandos do operador. braço robótico, microcontrolador ESP8266, robótica industrial, servomotores. Desenvolvimento de Hardware e Software de dispositivo para extensão de rede wireless e controle de dispositivos de automação residencial Este trabalho é desenvolvido em cima da criação de um dispositivo de automação residencial capaz de estender o sinal de uma rede Wi-Fi e ligar e desligar uma lâmpada remotamente, destacando aspectos técnicos sobre os mesmos, como peças de hardware envolvidas, tecnologias para programação do dispositivo e a união desses processos em um único sistema. Em adição a isso, também será desenvolvida uma página web que será o meio de comunicação entre o usuário final e o sistema. Automação. Residencial. Wi-Fi. Dispositivo. Ferramenta de software de auxílio ao fluxo e administração de fontes em ambientes de desenvolvimento Empresas de software tem cada vez mais baseado os seus passos de gerência de desenvolvimentem metodologias ágeis, tais como o Kanban e SCRUM. Tal adoção de padrões de desenvolvimento tem auxiliado a entregas com maior velocidade e principalmente qualidade, atendendo aorequisitos dos clientes sem comprometimento de tempo. Este trabalho tem por objetivo utilizametodologias ágeis para auxiliar o gerenciamento no dia-a-dia de uma empresa, permitindmaior visibilidade de status dos projetos e ainda dar liberdade para que os passos utilizadona iteração de desenvolvimento sejam alterados pelos usuários/gerentes de forma que atendnecessidades específicas de desenvolvimento de cada linguagemMétodos Ageis. Desenvolvimento. Agile. Gerenciamento. Lean. IMPLEMENTAÇÃO DO ALGORITMO DO CAIXEIRO VIAJANTE COM GPGPU O Problema do Caixeiro Viajante (Traveler Salesman Problem) é um problema de otimização com ampla margem para estudo e implementação de soluções. Com o avanço da pesquisa de aceleração de hardware e a utilização de placas de video para uso geral (GPGPU) foi possı́vel reduzir o tempo de execução de algoritmos que demandam extensos processamentos paralelos. Neste trabalho foi implementada uma solução para acelerar um algoritmo do caixeiro viajante utilizando GPGPU em comparação com a utilização de CPUs. Caixeiro Viajante, Processamento Paralelo, GPU, OpenCL, Aceleração de Hardware Sistema de avaliações de desempenho e solicitação de trabalhos para empresa Moore Prisma Este trabalho tem como objetivo apresentar o desenvolvimento de um sistema web voltado para aumentar a produtividade e assertividade nas atividades realizadas pelas equipes de auditores da Moore Prisma, empresa de auditoria e consultoria contábil. A ferramenta substitui a utilização de planilhas e formulários de serviços em nuvem, e possibilita diretores, encarregados e assistentes realizarem suas avaliações de desempenho e solicitarem trabalhos de auditoria para o departamento interno (BackOffice). O sistema atende os departamentos de auditoria interna, externa, de serviços financeiros e o departamento interno. Desenvolvimento Web. PHP. PDO. MySQL. AJAX."
  },
  {
    "id": 11,
    "name": "Claiton de Oliveira",
    "email": "claitonoliveira@utfpr.edu.br",
    "area": "Visão Computacional, Processamento de Imagens, Computação Gráfica Aplicação de Técnicas de Aprendizado de Máquina em Imagens de Satélites Meteorológicos O avanço do aquecimento global está tornando eventos climáticos severos cada vez mais frequentes. Serviços de meteorologia são essenciais para assegurar a segurança de habitantes da área afetada por eventos climáticos como tornados, furacões e inundações. A qualidade da previsão climática depende fortemente da qualidade e quantidade de dados meteorológicos. Uma grande parte da coleta desses dados acontece através de satélites meteorológicos. Estes equipamentos fornecem dados sobre a atmosfera em tempo real para centros de meteorologia. O recente desenvolvimento de algoritmos de aprendizado de máquina para realizar a análise de dados tem superado diversos algoritmos clássicos em diversas áreas de atuação. A análise de dados feita atualmente na área de meteorologia é fortemente baseada em algoritmos clássicos descritos por regras programadas manualmente. Métodos de análise de dados baseados em aprendizado em máquina tem o potencial de melhorar a qualidade e a velocidade de proces- samento desses dados. Este trabalho explora três técnicas baseadas em redes neurais para o processamento de dados de satélites meteorológicos geoestacionários. Tais técnicas são comparadas com os métodos atualmente utilizados para determinar o desempenho dos métodos propostos. As técnicas exploradas neste trabalho são a interpolação de sequências de imagens, colorização de imagens em tons de cinza e geração de um mapa de precipitação utilizando apenas dados de satélites geoestacionários. Aprendizado em Máquina, Interpolação de Quadros, Colorização, Mapa de Precipitação, Radar Meteorológico, Satélite Geoestacionário Desenvolvimento de uma ferramenta para o auxı́lio ao ensino de computação gráfica A computação gráfica está presente em diversas áreas do conhecimento, sendo assim, seu conteúdo demanda de materiais de apoio, os quais auxiliem no entendimento de seus conceitos. Sabe-se que o uso de diferentes recursos, como animação, áudio e entre outros podem contribuir para um melhor entendimento no ensino. Ambientes virtuais que fazem uso desses recursos vêm sendo usados de diferentes formas no ensino, assim o presente trabalho utilizará desse método para o desenvolvimento de uma ferramenta que auxilie no ensino de computação gráfica. Para o desenvolvimento foi utilizado um motor gráfico, sendo esse um software que integra diversas funcionalidades que facilitaram a construção do sistema. O aplicativo foi dividido entre módulos de ambientes tridimensionais (3D) interativos, os quais o usuário por meio de um processo exploratório tem a possibilidade de abordar os conceitos de computação gráfica. Computação Gráfica. Ensino. Ambientes Interativos. Unity3D. Leitura labial em vı́deos com a utilização de aprendizado profundo Nos últimos anos a evolução e popularização das técnicas de aprendizado de máquina permitiram com que algoritmos sofisticados de leitura labial automatizada fossem propostos. Paracompanhar tais algoritmos, datasets compostos por imagens preparadas para este fim foracriados, podendo conter imagens relacionadas a letras, dı́gitos, palavras ou frases ditas por uou mais falantes. Com isso, o presente trabalho apresenta a construção de um dataset compostpor imagens relacionadas a palavras sendo ditas por um único falante. Além disso, tambéforam utilizados modelos de aprendizado profundo baseados em redes neurais convolucionaipara realizar leitura labial automatizada sobre esse dataset atingindo até 90,28% de acuráciaLeitura Labial. Aprendizado Profundo. Rede Neural"
  },
  {
    "id": 12,
    "name": "Cléber Gimenez Corrêa",
    "email": "clebergimenez@utfpt.edu.br",
    "area": "Realidade Virtual, Visão Computacional, Teste de Software Métodos psicofisiológicos de avaliação de UX: um Mapeamento Sistemático A experiência de usuário (UX ou User eXperience) está presente na interação entre um usuário e um sistema ou produto. Este trabalho apresenta um mapeamento sistemático para analisar os métodos psicofisiológicos no contexto da usabilidade de sistemas computacionais, levantando os principais trabalhos da literatura que empregam esses métodos para avaliar a experiência do usuário. O mapeamento mostrou que dados psicofisiológicos quando cruzados com respostas fornecidas por outras formas de avaliação torna possı́vel obter conclusões que podem influenciar no desenvolvimento de sistemas que visam proporcionar experiências positivas. O mapeamento evidenciou a relação desses métodos e tecnologias de inteligência artificial, ambientes imersivos e veı́culo autônomos com redes neurais. User eXperience. Psicofisiológico. Mapeamento sistemático. Protótipo de aplicação computacional para o agronegócio A indústria de software abrange diversas áreas de mercado e está avançando cada vez mais no agronegócio. Com isso, há disponı́vel diversos sistemas para realização das funções do campo agrı́cola de forma automatizada e ágil, criando um mercado competitivo. Visando se destacar entre as soluções propostas, novas aplicações procuram cada vez mais garantir valor agregado e a satisfação do seu usuário. Uma maneira de atingir tal resultado é por meio de investimentos em usabilidade, que garantem satisfação na realização de tarefas durante a interação humano-computador. Para que um sistema tenha valor e qualidade desde a sua projeção, há etapas indispensáveis em seu planejamento, como estudo do público alvo, que pode ser realizado por meio de personas, envolvimento do cliente na construção de protótipos de alta fidelidade, que representem detalhadamente caracterı́sticas, especialmente na interface que o produto final irá possuir, e avaliações desses protótipos usando meios para coleta de dados qualitativos e quantitativos dos usuários, bem como técnicas de avaliação juntamente da aplicação de heurı́sticas. Este trabalho busca desenvolver um protótipo para validar e possibilitar o desenvolvimento de um sistema para identificação de plantas daninhas na cultura de soja, que auxilie o agricultor, com foco especialmente na interação humano-computador. Para atingir o objetivo, etapas de definição do perfil do usuário, de levantamento de requisitos, prototipação e avaliação do sistema com usuários, foram executadas utilizando abordagens disponı́veis na literatura, como ferramentas e questionários. Por meio dessas etapas aplicadas com auxilio do método de duplo diamante, chegou-se a uma conclusão que o passo a passo proposto garante uma descoberta mais aderente a realidade do usuário, gerando um protótipo que atinge o melhor valor de escala de usabilidade de software, e um perfil de usuário bem definido, trazendo oportunidades maiores de atuação do produto e garantindo uma maior adesão. Agropecuária. Avaliação. Interação humano-computador. Levantamento de requisitos. Prototipação. Usabilidade. CI ou CD UTILIZANDO A FERRAMENTA JENKINS: UM ESTUDO DE CASO A Engenharia de Software visa o desenvolvimento de software de forma ágil e com produtos confiáveis e de qualidade. Dessa forma, são necessárias práticas de desenvolvimento de software que propiciam para as equipes e corporações avanços significativos de agilidade em processos e de controle sobre suas aplicações e ambientes, incluindo testes de software e métricas de controle. Nesse âmbito, pode-se destacar práticas de DevOps, que envolvem integração e entrega contínuas (CI ou CD) para automação, monitoramento e controle do desenvolvimento de software. Pode-se destacar ainda ferramentas para CI ou CD, como a ferramenta Jenkins. O objetivo do presente trabalho é avaliar a viabilidade da aplicação da ferramenta Jenkins e seus periféricos no desenvolvimento de um software de identificação de pragas, doenças e plantas da Empresa Brasileira de Pesquisa Agropecuária (Embrapa), além da adoção de testes automatizados utilizando a ferramenta PHPUnit, levantando benefícios e limitações. As ferramentas foram úteis na inspeção da qualidade do código gerado pelo sistema de gerenciamento de conteúdo (CMS) e com a adoção da plataforma o fluxo de trabalho se torna mais ágil uma vez que o Jenkins realizou todos os passos de integração e entrega contínua de forma automatizada. Integração Contínua. Entrega Contínua. Jenkins. DevOps. Wordpress."
  },
  {
    "id": 13,
    "name": "Danilo Sipoli Sanches",
    "email": "danilosanches@utfpr.edu.br",
    "area": "Inteligência Artificial, Computação Evolutiva, Teoria dos Grafos"
  },
  {
    "id": 14,
    "name": "Debora Goncalves Ribeiro Dias",
    "email": "deboraribeiro@utfpr.edu.br",
    "area": "Tecnologias Assistivas, Ensino de Libras Mediado por Computador"
  },
  {
    "id": 15,
    "name": "Eduardo Cotrin Teixeira",
    "email": "cotrin@utfpr.edu.br",
    "area": "Banco de Dados, e-Science (Big Data), Desenvolvimento de Software , Ferramentas Pedagógicas Análise do uso de Sistemas de Informação de Gerenciamento de Projetos (SIGP) em projetos de software de grandes empresas de tecnologia do mercado nacional Os Sistemas de Informação de Gerenciamento de Projetos (SIGPs) são aplicativos de software projetados especificamente para auxiliar equipes de gerenciamento no planejamento, monitoramento e controle de projetos. São comumente baseados em ferramentas e boas práticas de gestão de projeto mapeadas pelo PMI (Project Management Institute) e reportadas no Guia PMBOK (Project Management Body of Knowledge), abrangendo desde práticas tradicionais até metodologias ágeis. O objetivo deste trabalho de conclusão de curso é demonstrar por meio de pesquisa de campo o quanto os SIGPs são efetivamente utilizados por membros de projetos na área de tecnologia, além de quantificar o tempo gasto de gestão quando são utilizados estes sistemas, e para qual finalidade são mais utilizados. A metodologia do trabalho compreende um estudo teste com pesquisa multidisciplinar, e a análise de dados quantitativos coletados por meio de um formulário. Os dados obtidos revelam que as empresas de tecnologia pesquisadas possuem sistema de gestão atualizado, mas que podem ser melhorados em alguns pontos para aprimorar a gerência dos projetos. PMI. Ferramentas de gestão. SIGP."
  },
  {
    "id": 16,
    "name": "Eduardo Filgueiras Damasceno",
    "email": "damasceno@utfpr.edu.br",
    "area": "Realidade Virtual, Aumentada, Estendida (RV/RA/XR),  Interfaces Naturais - Natural User Interface Aplicações em Saúde - Informática Médica Neurociência e Neurocomputação - Brain Computer Interface Informática na Educação Análise do Tipo de Gênero de Games para Crianças entre 09 a 12 anos Nas últimas décadas os jogos digitais invadiram vários setores de nossas vidas, estes transcenderam a função de entreter e são usados para outros fins, como: lucrativos (cryptogames), na área de saúde e também na educação. Neste contexto, os serious games são jogos com o objetivo de transmitir informação através de diversão. Entretanto, existem diversos gêneros de jogos para atingir estes objetivos, portanto este trabalho tem como objetivo analisar quais os tipos de gêneros de serious games para crianças entre 09 a 12 anos são mais apropriados. Para isto será criado um questionário para coletar dados com o objetivo de destacar os melhores gêneros de jogos para serem usados na criação de serious games. Serious Games. Game Design. jogos digitais. SUPA - SISTEMA UNIFICADO DE PÓS-GRADUAÇÃO Atualmente a seleção de candidatos para os programas de pós-graduação é realizada através da entrega de uma série de cópias de documentos. Junto a isso, cabe aos orientadores analisar e classificar cada uma das fichas de inscrição recebidas pela secretaria de pós-graduação. O presente trabalho traz uma alternativa ao sistema atual de seleção, trazendo facilidade e transparência de todo o processo para os alunos, e mais eficiência para os professores, sem a necessidade de interferência humana. Para tanto, utilizou-se o processo de desenvolvimento Scrum Solo para a criação da primeira versão de uma aplicação web que informatiza o processo público de gestão, inscrição e seleção de candidatos nesses programas. sistema de informação para internet; tecnologia web; seleção de candidatos. DESENVOLVIMENTO DE INTERFACES E INTEGRAÇÕES SAP: ESTUDO DE CASO E APLICAÇÕES PRÁTICAS O trabalho abordado, apresenta um estudo de caso e aplicações práticas do desenvolvimento de interfaces com SAP. O principal objetivo do estudo é desenvolver um programa em ABAP que gere um relatório que divida os usuários por empresa e suas licenças SAP. O programa foi desenvolvido com o intuito de facilitar o processo de auditorias internas e externas, e consequentemente, economizar tempo no processo de auditoria. SAP. ABAP. Desenvolvimento. DO DESENVOLVIMENTO BACK-END A LIDERANÇA TÉCNICA Este trabalho escrito em formato de relatório descreve as atividades profissionais exercidas na empresa IBM e as relaciona com alguns dos conteúdos aprendidos em sala de aula durante a graduação em Engenharia de Computação na UTFPR. A IBM é uma das maiores e mais relevantes multinacionais de tecnologia do mundo. A IBM Consulting se trata de uma subdivisão da IBM, cuja função é prestar serviços de consultoria de negócios e de tecnologia para diversos clientes. Trabalhou-se durante o último ano em um projeto de consultoria que promoveu grande transformação digital. Durante o período em que esse foi desenvolvido, foram realizadas atividades de desenvolvimento e de liderança técnica. As atribuições de desenvolvimento envolveram a criação de microsserviços Java, utilizando os frameworks Spring Boot e Apache Camel e o middleware orientado à mensagem RabbitMQ. As atribuições de liderança técnica, por sua vez, envolveram prestar apoio aos desenvolvedores do time, garantir o cumprimento de prazos e sustentar a qualidade do desenvolvimento. O objetivo de todo o trabalho prestado foi realizar entregas com a maior qualidade possível dentro do tempo previsto. Durante o período trabalhado, foram utilizados muitos conceitos aprendidos, principalmente, nas disciplinas de Programação Orientada a Objetos, Programação para Web, Programação Desktop, Sistemas Distribuídos e Redes de Computadores. A formação adquirida na UTFPR foi indispensável para o desenvolvimento de uma carreira de rápida ascensão e para o sucesso da plataforma. Desenvolvimento back-end. Java. Microsserviços. Liderança técnica."
  },
  {
    "id": 17,
    "name": "Érica Ferreira de Souza",
    "email": "ericasouza@utfpr.edu.br",
    "area": "Teste de Software Gestão do Conhecimento na Engenharia de Software Um estudo de caso com a ferramenta de teste baseado em modelo XState A aplicação de testes é essencial quando se busca a qualidade de software no processo de desenvolvimento. Diversas abordagens da literatura almejam automatizar esse processo, procurandreduzir o tempo de implementação e ampliar a cobertura dos testes em relação aos requisitodo software em questão. Uma dessas abordagens é conhecida como teste baseado em model(TBM). Essa abordagem propõe a derivação de casos de teste através de um modelo baseadnos requisitos de um ou mais fluxos do software. Por se tratar de uma abordagem teóricaé possı́vel aplicar os conceitos do TBM em inúmeras áreas de desenvolvimento, utilizanddas mais variadas técnicas e tecnologias. Este trabalho apresenta um estudo de caso atravéda comparação dos resultados de duas abordagens de TBM, cada uma desenvolvida usanddiferentes tecnologias, porém inseridas no contexto de aplicações Web. A primeira abordagemchamada MoLeWe, desenvolvida na linguagem Java, faz uso do framework Selenium WebDrivee utiliza a técnica de modelagem event sequence graphs (ESG) para criar os modelos quposteriormente serão usados para gerar os casos de teste. A segunda abordagem, existentna prática, foi aplicada em um conjunto de aplicações utilizando Javascript e os frameworkXState e Cypress, bem como a técnica de máquinas de estado finitos (MEF) para modelagemMétricas obtidas na aplicação da abordagem XState foram coletadas e comparadas com oresultados da abordagem MoLeWe, o que permitiu destacar pontos positivos e negativos dprimeira abordagem em relação à segunda. Considerando a capacidade de atingir uma coberturde código próxima à MoLeWe, as técnicas e tecnologias da abordagem XState se mostraracomo possı́vel opção de escolha para a aplicação dos conceitos do TBMTeste de software. Teste baseado em modelo. Finite state machines. Event sequence graph. Java. Selenium. Javascript. XState. Cypress. Uma arquitetura para extração e visualização de Test Smells em Testes Automatizados com Robot Framework Muitas áreas da tecnologia da informação estão suscetı́veis às más práticas de programação e escrita de códigos, chamadas de Code Smells. Em projetos de códigos de testes automatizados, identifica-se a ocorrência como Test Smells. Um método conhecido para realizar o processo de automação em códigos é fazer uso da ferramenta Robot Framework, que utiliza técnicas que ajudam o desenvolvedor a ter uma compreensão mais fácil do que está sendo testado. Prontamente, o Robot Framework também está suscetı́vel à criação de Test Smells. Para mitigar os impactos dos Test Smells em códigos Robot, alguns trabalhos propõem ferramentas que detectam a existência destes nos códigos, gerando, ao final do processo, um relatório. Este trabalho visa construir uma arquitetura para realizar a extração dos relatórios gerados e persisti-los em uma base de dados, a fim de construir um meio que auxilia na visualização da evolução dos Test Smells em códigos Robot e na tomada de decisão do gerenciamento dos códigos de projetos para automação que utilizam o Robot Framework, baseando-se na ferramenta visual Kibana. Robot Framework. Smells. Ferramenta de Detecção. Ferramenta de Visualização. Automação de Testes."
  },
  {
    "id": 18,
    "name": "Fábio Fernandes da Rocha Vicente",
    "email": "fabiofernandes@utfpr.edu.br",
    "area": "Bioinformática Reconhecimento de Padrões Localização Indoor de Beacons Bluetooth Low Energy em ambiente de Interferência de Sinal Este trabalho apresenta a implementação de um sistema de software e hardware para a localização indoor de beacons bluetooth low energy em um ambiente com interferência. Tambéapresenta a realização de um experimento que envolve multilaterização de beacons BLE eum cenário onde há 6 âncoras para definição de suas posições no plano cartesiano, conceitconhecido na literatura como IPS, que se assemelha ao funcionamento do GPS, porém eambientes menores e com aplicabilidades distintas. Como uma dificuldade real encontrada eoutros trabalhos, o ambiente no qual foram realizados os experimentos continha interferêncide sinal, dificultando o cálculo de distância entre os dispositivos emissores e receptores, o qufaz com que os experimentos apresentem uma imprecisão média de 11,82m2 . Então, commedida de prevenção de erros de leitura, propôs-se a utilização de dois beacons de posiçõefixas para predição do coeficiente de ambiente no instante da leitura, para que a precisão fossmaior. E como resultado, obteve-se uma melhora de aproximadamente 52,3% nos resultadosIPS. IoT. Bluetooth Low Energy. Multilateração. Trilateração."
  },
  {
    "id": 19,
    "name": "Fabrício Martins Lopes",
    "email": "fabricio@utfpr.edu.br",
    "area": "Bioinformática Reconhecimento de Padrões Inteligência Computacional Processamento de Imagens Modelo de alto desempenho para portais de notı́cias através do uso de Docker e múltiplos bancos de dados O número de pessoas conectadas à internet cresce a cada ano, por consequência o uso de mı́dias online também aumenta. Com isso os sistemas necessários para suportar o crescente número de usuários fica cada vez mais custoso e muitas vezes acaba não sendo suficiente para picos inesperados de acesso. Esse trabalho propõe um modelo de arquitetura a ser seguido que tem como finalidade aumentar o desempenho e reduzir o custo financeiro de sistemas que possuem grande demanda, tornando-os mais resilientes e escaláveis. Sistemas Distribuı́dos. Arquitetura de Software. Padrões de Design. Aplicativo móvel com foco no trajeto de rotas para portadores de deficiência motora ou pessoas com mobilidade reduzida É importante a melhoria da qualidade de vida da população e muitos esforços nas mais diversas áreas têm sido desenvolvidos. Um público em particular que merece atenção são os portadores de deficiência motora ou de mobilidade reduzida. Logo, é necessário o desenvolvimento de ações que contribuam para o auxílio na locomoção das pessoas com limitações motoras. Este trabalho tem como objetivo o desenvolvimento de uma solução de software para auxiliar tais pessoas a transitarem para seus destinos, informando-as se existe uma rota possível, qual a melhor para se seguir e qual a qualidade das ruas e calçadas que as mesmas passarão. Aplicativo Móvel. Deficientes Motores. Rotas. Vias Públicas. INFERÊNCIA DE REDES GÊNICAS: Validação de Inferência da Rede para a Bactéria Escherichia Coli Escherichia Coli é uma bactéria com uma notável capacidade de causar infecções. Surtos de doenças causadas por ela podem afetar muitos indivı́duos. Compreender como seus genes se relacionam pode ajudar no tratamento e prevenção de infecções. Neste contexto, a inferência de redes gênicas pode ser utilizada para recuperar a rede da E. coli. No entanto, há um problema ao se inferir redes gênicas: a quantidade de variáveis é muito grande em relação a quantidade de amostras. Uma possı́vel solução é adotar dados biológicos já conhecidos. Assim, este trabalho propõem validar a inferência da rede da E. coli com o uso dados biológicos já existentes. Desta forma pode-se analisar se o uso de tais dados podem ajudar no processo de inferência. Inferência de redes gênicas. Escherichia Coli. Validação. "
  },
  {
    "id": 20,
    "name": "Flávia Belintani Blum Haddad",
    "email": "flaviahaddad@utfpr.edu.br",
    "area": "Engenharia de software Engenharia de requisitos Processo de software Gestão de Projetos de Software IMPLEMENTAÇÃO DE UMA APLICAÇÃO DE SUPORTE AOS CUIDADOS DA ROTINA MEDICAMENTOSA DE IDOSOS BRASILEIROS As doenças crônicas não transmissı́veis (DCNT) afetam mais da metade da população brasileira, em especial, cerca de 69% da população idosa porta pelo menos uma DCNT. O controle da doença, redução de morbilidade e melhoria na qualidade de vida depende da administração adequada de diferentes medicações contı́nuas. Atrelada à utilização de diferentes medicamentos, simultaneamente, existe a propensão de déficits de memória em pacientes idosos, tornando portanto, complexa para estas pessoas a tarefa de ingerir medicamentos nos horários e dosagens corretas. Ademais, considerando a curva de crescimento da população idosa brasileira, a preocu- pação com a qualidade de vida desta faixa etária aumenta e o investimento em soluções voltadas a este fim também. Sendo assim, pensando na atenção ao tratamento dos idosos, o presente trabalho propõe a implementação de um aplicativo móvel de suporte para idosos brasileiros, e seus familiares e profissionais de saúde responsáveis, para a manutenção e acompanhamento de uma rotina de polifarmácia ideal da população idosa brasileira. Dado isto, é esperado que pacientes idosos consigam conduzir sua rotina medicamentosa de forma correta por meio de um Calendário Posológico e que seus responsáveis possam acompanhar e administrar sua rotina gerindo as medicações por meio do aplicativo. Polifarmácia. Doenças Crônicas. Saúde do idoso. Rotina medicamentosa. Aplicativo móvel. Métodos Ágeis. Estudo de caso: Aplicação de Metodologias Ágeis em desenvolvimento de melhorias para ERP Para agregar valor a uma companhia não basta mais realizar uma alta entrega de demanda, a qualidade desta entrega se tornou mais importante que a quantidade. Sendo assim, a utilização de métodos para organizar os processos de entrega e garantir sua qualidade se tornaram essenciais. O objetivo deste trabalho é aplicar métodos ágeis nos processos da área de sistemas de uma empresa de grande porte, afim de melhorar a qualidade das entregas. Obteve-se uma melhora em relação ao atendimento de chamados, aplicação de novos desenvolvimentos em ambiente de produção e testes referentes ao software que a área administra, onde antes não existia uma definição de processo. Não houve um método especı́fico aplicado para desenvolver os novos fluxos de trabalho, mas sim um aproveitamento do conceito geral de ágil, aplicando partes de Scrum, Extreme Programming e KanBan. Sendo assim, concluiu-se que os novos processos criados embasados nos métodos ágeis entregam valor à área e ao negócio da empresa, diminuindo erros em tempo de execução do software e trazendo a satisfação do cliente interno. ERP. Metodologia Ágil. Scrum. Quality Assurance. Estudo comparativo entre as ferramentas Visure e ReqTest para gerenciamento de requisitos No desenvolvimento de um projeto de software podem haver mudanças de requisitos devido à vários fatores, seja pela mudança de negócio ou as exigências dos clientes. Isso pode gerar transtornos a todos os envolvidos no projeto se não for feito da forma correta. Sendo assim, é importante gerenciar essas mudanças. A Engenharia de Requisitos provê métodos para que esses processos de desenvolvimento de software ocorram de forma que se evitem erros e dupli- cidades. E para isso, é necessário que haja um controle dos requisitos de software. Em grandes projetos torna-se inviável esse controle de forma manual, através de tabelas ou planilhas. Com a pressão para entregar um projeto grande de forma mais rápida possível, o gerenciamento de requisitos se torna uma tarefa maçante que acaba sendo deixada de lado pela grande comple- xidade com que se dá, e isso pode gerar erros que se tornarão caros no final do projeto. Por isso, é essencial que se utilize ferramentas para o gerenciamento de requisitos, que permitem o versionamento dos requisitos e sua rastreabilidade para que não ocorram falhas e redundâncias. Este trabalho tem por objetivo realizar uma pesquisa comparativa entre as ferramentas Visure e ReqTest, ambas as ferramentas são pagas, porém possuem avaliação gratuita. As ferramentas possuem as funcionalidades necessárias para atender em parte ao processo de gerenciamento de requisitos, conforme será explicado posteriormente. Espera-se que esse documento possa auxiliar as organizações a decidirem qual ferramenta utilizar para gerenciamento de requisitos no desenvolvimento do seu software. Requisitos. Gerenciamento de requisitos. Ferramentas. SIMULAÇÃO DE PROPOSTA DE JOGO DE EMPRESA UTILIZANDO AMBIENTE DE DESENVOLVIMENTO DISTRIBUÍDO DE SOFTWARE COMO ESTRATÉGIA PARA DESENVOLVER HABILIDADES PROFISSIONAIS Os jogos surgiram como ferramenta para simulação e treinamento militar, sempre presente na história do homem. Em 1957 passou a ser utilizado na aprendizagem como ferramenta de en- sino nos Estados Unidos, dando origem aos Jogos de Empresas. No Brasil os Jogos de Empresa, surgiram na década de 1970, importado dos EUA sendo utilizado como ferramenta de ensino e aprendizagem. O estudo tem como objetivo elaborar um jogo de empresa para realizar treina- mentos a fim de desenvolver habilidades profissionais simulando ambiente de desenvolvimento distribuı́do de software. A metodologia utilizada é caracterizada como pesquisa descritiva e qualitativa, com aplicação da pesquisa bibliográfica e da pesquisa experimental. Conclui-se que, com a realização do jogo de empresa é possı́vel simular do ambiente de desenvolvimento distribuı́do de software e desenvolver habilidades profissionais dos colaboradores por meio da absorção do conhecimento proposto. jogos de empresa, desenvolvimento distribuido de software, simulação Aplicação mobile no âmbito de jogos educacionais direcionado ao ensino da Libras O trabalho em questão apresenta o desenvolvimento de uma aplicação mobile para o ensino da Lı́ngua Brasileira de Sinais, que utiliza conceitos de jogos educacionais, a fim de trazer motivação aos usuários por meio de desafios e recompensas em um jogo de perguntas e respostas. Durante o texto é tratada a eficiência dos métodos tradicionais de ensino e como metodologias alternativas podem servir de complemento na educação. Apresenta o surgimento dos jogos educativos e a sua influência no desenvolvimento educacional de crianças e adultos que são submetidos diariamente a este método. Evidencia a história da Libras apresentando conceitos, definições e curiosidades dessa lı́ngua tão pouco explorada. A metodologia utili- zada no projeto com uma descrição completa do sistema, métodos e ferramentas utilizadas em cada etapa do processo de desenvolvimento. O desenvolvimento da aplicação propria- mente dito. Apresenta como resultado a evolução dos protótipos com as devidas melhorias através do método de desenvolvimento prototipação evolutiva até o protótipo final da aplica- ção e os testes de usabilidade realizados, a fim de solucionar problemas e realizar melhorias nas funcionalidades e avaliar a curva de aprendizado do usuário. Por fim, a conclusão do projeto. Libras. Metodologias de Ensino. Jogos Educacionais. Desenvolvimento de Jogos. Unity. TRABALHO DE DESENVOLVEDOR DE JOGOS UTILIZANDO O MOTOR UNITY Com o crescimento da industria de jogos eletrônicos o cargo de desenvolvedor de jogos vem ganhando destaque na área de tecnologia. Esse trabalho visa explorar o conhecimento técnico e os desafios relacionados com a profissão de desenvolvedor de jogos no contexto do motor Unity. Considerando como o motor é usado como ferramenta para auxiliar a criação de jogos digitais. Jogo. Unity. Desenvolvedor de Jogos. PRINCIPAIS ATIVIDADES DO PRODUCT OWNER O objetivo do gerenciamento de projetos é garantir o cumprimento do escopo, dos prazos, dos custos e da entrega dos produtos com a qualidade esperada pelo cliente. Existem diversas metodologias e frameworks que podem ser utilizados para o gerenciamento. O Scrum é um framework de gerenciamento ágil utilizado para melhorar a produtividade das equipes de desenvolvimento. Dentro do Scrum existe o papel do Product Owner, a pessoa responsável por agir como elo entre o cliente, a equipe de desenvolvimento e o produto em si. O documento detalha as principais funções do dia-a-dia de um Product Owner na empresa Luby Software. Proprietário do Produto. Gestão de Projetos. Scrum. ANALISANDO O IMPACTO DO PROFISSIONAL DE QUALITY ASSURANCE EM PROJETOS SCRUM: UM ESTUDO ENTRE DOIS CASOS REAIS O papel do profissional de Garantia de Qualidade (QA) no desenvolvimento de software é fundamental para garantir a qualidade, confiabilidade e eficácia dos produtos e projetos. O QA desempenha um papel estratégico ao implementar e monitorar processos e práticas que visam identificar e prevenir defeitos e falhas. No entanto, em alguns projetos que adotam a metodologia SCRUM, a ênfase na agilidade pode resultar na ausência de atenção à qualidade, prejudicando a entrega de um produto de valor.Neste trabalho, serão apresentados dois projetos que ilustram essa situação. O primeiro projeto será analisado antes e depois da entrada do profissional de QA. Será possı́vel observar as melhorias alcançadas após a inclusão desse profissional, como a redução de retrabalho e a melhoria na eficiência dos processos. O segundo projeto contará com um profissional de QA desde o inı́cio do desenvolvimento. Será analisada a contribuição desse profissional desde as etapas iniciais do projeto, visando comparar os resultados obtidos com o projeto anterior. Serão levantados dados e métricas para uma análise comparativa entre os dois projetos.Essa análise permitirá identificar o impacto do profissional de QA na qualidade e no sucesso do projeto, além de evidenciar os benefı́cios de incluir esse papel desde o inı́cio. A comparação dos dados coletados fornecerá insights valiosos sobre a importância de considerar a qualidade como parte essencial do processo ágil e destacará a contribuição do QA para agregar valor ao produto final. Ao final do estudo, será possı́vel compreender melhor como o papel de QA pode influenciar positivamente os resultados de projetos ágeis, reforçando a necessidade de equilibrar agilidade com qualidade. A análise comparativa entre os projetos fornecerá uma base sólida para a tomada de decisões e a adoção de práticas mais eficazes em futuros projetos, buscando sempre a excelência na entrega de produtos de software. Quality Assurance. SCRUM. QA. Garantia de Qualidade."
  },
  {
    "id": 21,
    "name": "Francisco Pereira Junior",
    "email": "fpereira@utfpr.edu.br",
    "area": "Processamento de Alto Desempenho Programação Paralela e Distribuída Biga Data / Analytics Ciência de Dados Aplicada à Gestão Pública Ciência de Dados Aplicada à Dados Financeiros Lei de Acesso à Informação (LAI): um estudo de caso dos abastecimentos dos veı́culos da Companhia Municipal de Trânsito e Urbanização de Londrina (CMTU) A Lei de Acesso à informação (LAI) permite que o cidadão possa solicitar e receber informações de gastos de todos os órgãos e entidades públicas. Porém, a falta de padronização e o grande volume dos dados disponibilizados dificultam o seu entendimento e uma análise mais detalhada dos dados. Desta forma, uma melhora na visualização e padronização dos dados se torna necessária, com a mesma se torna possı́vel extrair informações escondidas em um arquivo Excel, como flutuação de preço e frequência de abastecimentos. Técnicas de mineração de dados foram utilizadas para realizar a coleta, o tratamento e a análise de gastos públicos da Companhia Municipal de Trânsito e Urbanização de Londrina, com o intuito de transformá-los em informação mais acessı́vel para o cidadão comum. LAI. Análise de dados. Big Data. DESENVOLVIMENTO DE UM JOGO ELETRÔNICO PARA AUXILIAR NO ENSINO DE PROGRAMAÇÃO ORIENTADA A OBJETOS As linguagens de programação mais utilizadas no Brasil e no mundo utilizam o paradigma de Orientação a Objetos (OO). Sendo assim, é necessário que o aprendizado deste paradigma seja eficiente, para que os futuros profissionais da área de tecnologia da informação estejam mais qualificados para o mercado. O intuito deste trabalho foi criar um jogo eletrônico para servir de ferramenta de ensino e prática aos conceitos de OO, de modo que os jogadores conseguiriam visualizar de forma gráfica os conceitos de OO. A familiarização com os conceitos de OO pode melhorar o aproveitamento dos alunos nas disciplinas correlatas e simplificaria a transição entre linguagens de programação, caracterı́stica esperada pelo mercado de trabalho. Orientada a Objetos. Programação. Jogo Eletrônico. Jogo Educacional."
  },
  {
    "id": 22,
    "name": "Gabriel Canhadas Genvigir",
    "email": "gabriel@utfpr.edu.br",
    "area": "Banco de Dados Manutenção de Software Sistemas de Informação APLICATIVO MÓVEL PARA SUBSTITUIÇÃO DA INTERFACE DE USUÁRIO VISANDO MELHOR ACESSIBILIDADE PARA USUÁRIOS DA TERCEIRA IDADE EM SMARTPHONES COM SISTEMA OPERACIONAL ANDROID Devido ao aumento na busca por smartphones por parte de usuários da terceira idade, buscam-se alternativas para melhorar a acessibilidade para este público, visto que atualmente os dispositivos móveis possuem limitações em seus recursos e ferramentas para atender este público. Neste contexto, o presente trabalho consiste no desenvolvimento de um aplicativo para substituição da interface padrão dos smartphones com sistema operacional Android, visando uma interface de fácil usabilidade e compreensão de forma a atender as necessidades básicas dos usuários da terceira idade. Terceira idade. Smartphones. Android."
  },
  {
    "id": 23,
    "name": "Gabriel Costa Silva",
    "email": "gabrielcosta@utfpr.edu.br",
    "area": "Desenvolvimento web Desenvolvimento de aplicações em nuvem/cloudware Evolução arquitetural de software Desenvolvimento do módulo de coleta de dados de pulverização do manejo de culturas Esse projeto visa aumentar a eficiência na coleta e análise de dados da tecnologia de Manejo Integrado de Pragas (MIP) em várias culturas, como feijão e milho. O MIP é uma tecnologia de procedimentos ambientais e econômicos para reduzir o uso de inseticidas por meio do controle efetivo de pragas. Dado o limitado acesso à internet em regiões rurais, existe a necessidade de uma solução que permita registrar, de forma offline, as pulverizações realizadas durante a execução do MIP. Foi desenvolvido o módulo de registro de pulverizações, que será integrado ao aplicativo manejo.culturas, e disponibilizado aos técnicos do IDR e instrutores do SENAR. Para a implementação foram utilizadas técnicas tradicionais da Engenharia de Software, como gerenciamento de versão, teste de software e prototipação. Utilizando a tecnologia hı́brida React Native para o desenvolvimento do aplicativo tanto para Android como para iOS. Smartphones – Programação. Interface de programas aplicativos (Software).Computação móvel. JavaScript (Linguagem de programação de computador)."
  },
  {
    "id": 24,
    "name": "Giovani Volnei Meinerz",
    "email": "giovanimeinerz@utfpr.edu.br",
    "area": "Banco de Dados Gestão de Conhecimento (Big Data) Abordagem lexical para análise de sentimento no contexto do mercado de ações brasileiro Aproximadamente dois terços da população mundial possuem acesso à Internet. Grande parte dos usuários a utilizam principalmente para acessar seus perfis em redes sociais, onde publicam e compartilham opiniões e notı́cias a respeito de produtos, serviços, organizações, entre outros aspectos do dia a dia, como é o caso do Twitter. No microblog, os usuários, limitados a textos de no máximo 280 caracteres, publicam seus pontos de vista sobre os assuntos de interesse quase que em tempo real, sendo material de grande valor para a tarefa de Análise de Sentimentos. Nesse sentido, tal conteúdo pode servir como um fator preditivo no contexto do mercado de ações, e que vem ganhando força no cenário brasileiro nos últimos anos, sendo que, a partir do sentimento coletivo identificado nos textos publicados, existe a possibilidade de prever a tendência da oscilação dos preços das ações. No entanto, analisar um grande volume de textos em um curto espaço de tempo, consiste em uma tarefa que excede os limites da capacidade humana. Por isso, o uso de ferramentas computacionais que sejam capazes de automatizar e agilizar o processo é visto como promissor. Assim, dado o exposto, o objetivo deste trabalho foi a criação de um dicionário léxico especı́fico para o mercado de ações brasileiro, visando melhorar a assertividade da tarefa de Análise de Sentimentos de textos e headlines de notı́cias publicados no Twitter, bem como permitir que o usuário customize o dicionário léxico criado, adicionando, editando e removendo termos, por meio de uma interface web de anotação. Como resultado, obteve-se uma taxa de assertividade de 56% no melhor dos casos, um desempenho aquém do esperado. Porém, para a interface web de anotação, foi possı́vel desenvolvê-la de maneira simples e que atendesse os requisitos estabelecidos, utilizando como ferramenta o framework Streamlit, sendo o resultado final satisfatório. Mercado de Ações. Twitter. Notı́cias. Análise de Sentimento. Dicionário Léxico."
  },
  {
    "id": 25,
    "name": "Henrique Yoshikazu Shishido",
    "email": "shishido@utfpr.edu.br",
    "area": "Escalonamento de tarefas Programação para dispositivos móveis Informática em Saúde Computação paralela Aplicativo de controle de pedidos para restaurante - compatı́vel com as plataformas iOS e Android Para que um restaurante tenha bons resultados ao oferecer seus serviços, é necessário que seu atendimento seja satisfatório a seus clientes, por exemplo, evitar erros e atrasos excessivos ao providenciar os pedidos. Neste trabalho desenvolveu-se um aplicativo para dispositivos móveis que atenderá tanto aos clientes quanto aos colaboradores de restaurantes. Aos clientes o aplicativo permite que este execute tarefas que antes precisavam do acompanhamento de um garçom para serem feitas, tais como visualizar cardápio, realizar pedidos, fazer avaliações, entre outras. Aos colaboradores, o aplicativo oferece funcionalidades de controle das atividades, do ambiente e das pessoas envolvidas com os clientes e colaboradores. Dentre as funcionalidades, direcionadas para os funcionários e proprietários de restaurante, cita-se a visualização de pedidos e suas possı́veis condições, atendidos e não atendidos. Também pode-se gerenciar o ambiente como as mesas e os funcionários. Esta proposta busca mitigar erros no registro de pedidos, de atrasos em atendimentos, minimizar os gastos com salário de garçons adicionais e com aquisição de materiais de insumos, inclusive os de escritório. Como preparação para o desenvolvimento deste trabalho, foram realizados o estudo de Mercado em Artigos e Sistemas de Empresas do ramo tecnológico, a definição do modelo de processo de desenvolvimento e por meio deste o levantamento de requisitos. Aplicativo. Restaurante. Pedidos. React Native. MySQL. APLICATIVO MÓVEL PARA GERENCIAMENTO DE DISPOSITIVOS DE SMART HOME O desenvolvimento de um aplicativo móvel que efetue o gerenciamento de dispositivos de smart home, pode ser interessante as pessoas que buscam liberdade e condições de poder criar e projetar suas próprias automações. O desenvolvimento deste projeto resultou em uma aplicação que dá aos usuários condições de realizar o controle e acionamento de iluminação, tomadas e fechaduras, efetuar a leitura de dados da residência, como de sensores de temperatura, umidade e chuva, utilizando uma conexão com servidor Cloud para armazenamento e a integração com o hardware. Para o desenvolvimento da aplicação, foi definida a criação de uma metodologia própria de desenvolvimento de software, baseada no processo XP com o auxı́lio da ferramenta Kanban. O desenvolvimento foi dividido em 4 atividades principais, o planejamento, projeto, codificação e teste. O cronograma para a realização das atividades foi respeitado, considerando que foi segmentado o desenvolvimento para não haver uma sobrecarga de trabalho. Os requisitos, descritos em user stories (história de usuários), descrevem de maneira simples as informações levantadas conforme os feedbacks dos usuários durante o levantamento de requisitos. A utilização de uma ferramenta como intermediadora entre o Hardware e o aplicativo foi pensada e escolhida para trazer maiores comodidades aos usuários, além de proporcionar um maior controle dos equipamentos e uma maior segurança em não concentrar as informações no próprio aplicativo, tornando todo o projeto uma solução descentralizada. A aplicação não depende de estar conectada diretamente com dispositivo e sim somente com o banco de dados, fazendo com que os dispositivos funcionem independentemente uns dos outros. Com a escolha do uso do servidor Cloud como centralizador das informações, tornou-se disponı́vel a possibilidade que diferentes smartphones com o aplicativo instalado, se conecte com uma base de dados independente e sem interferir em outras contas cadastradas, tornando o aplicativo uma ferramenta com suporte a múltiplos usuários. Smart Home; Cloud; Processo XP; Kanban. APLICATIVO MÓVEL PARA RASTREAMENTO DE HISTÓRICO VEICULAR Com o crescente aumento da frota brasileira, um fato preocupante chama atenção, em 2021 a idade média dos veı́culos em uso chegou a 10,2 anos, ou seja, a frota mais velha dos últimos 25 anos. Fato este sendo resultado da valorização dos veı́culos zero quilômetros, fator este que impulsiona cada vez mais a busca de veı́culos usados para suprir a demanda, porém estes dependem de uma atenção especial na sua comercialização. Diferentemente de um veı́culo zero km, não há um valor especı́fico de venda e compra, pois este depende de diversos fatores do mercado para sua precificação. No entanto, é comumente utilizado a tabela Fipe como um valor de referência, visto que informa o valor médio da venda dos veı́culos no paı́s, porem há uma brecha nesta abordagem, dado que deixa de fora fatores muito importantes, como, por exemplo, o estado de conservação de um veı́culo. Com essa adversidade em questão, e visando realçar veı́culos que tenham um histórico comprovado, este trabalho projetou e desenvolveu uma aplicação em que permite o proprietário de um veı́culo gerenciar e compartilhar uma linha do tempo de alterações, ocorrências e benfeitorias realizadas no veı́culo. Veı́culo. Histórico veicular. Aplicativo móvel. Aplicativo móvel para controle de carteira de investimentos Com o crescente aumento de pessoas se preocupando mais com finanças pessoais, um novo movimento foi iniciado no Brasil, o movimento de pessoas buscando uma forma de investir o seu dinheiro afim de aumentar o seu patrimônio e/ ou ter uma renda passiva. O problema nos investimentos são o controle dos mesmos, visto que existem diversas categorias de investimentos e cada uma possui uma burocracia e peculiaridade própria, com esse pensamento surgiram diversas formas de se acompanhar os investimentos, desde formas clássicas como anotações em folhas, até formas mais modernas como planilhas com cálculos complexos e aplicações especificamente criadas para essa finalidade. Existem diversas aplicações que suprem essa demanda de controle de investimentos, porém ainda existe a necessidade de se trabalhar com uma deficiência em oferecer uma interação social nas aplicações de investimentos, interação essa que tornaria a utilização da aplicação mais interessante e motivadora para os usuários. Com este pensamento, esse trabalho teve como objetivo propor, projetar e desenvolver uma aplicação para dispositivos móveis multiplataforma para o controle de investimentos, utilizando uma estratégia de gamificação afim de ranquear os usuários por sua rentabilidade e tornar visı́vel esse ranqueamento para outros usuários, criando uma interação social e motivando usuários a buscar formas de tornar seus investimentos mais rentáveis. Este trabalho utiliza como processo de desenvolvimento uma adaptação utilizando o Modelo Cascata e o Modelo de Prototipação com o propósito de se utilizar os pontos positivos de cada modelo. Investimentos. Gamificação. Controle de finanças pessoais. Aplicativo móvel. Aplicativo móvel para gerenciamento de atividades complementares dos discentes do Departamento de Computação da UTFPR Cornélio Procópio A utilização das atividades complementares como forma de enriquecimento acadêmico nas universidades é uma prática que foi instituı́da em 2003, pelo Ministério da Educação, e descrita nas Diretrizes Curriculares dos Cursos de Graduação. A participação dos alunos nessas atividades é fundamental não apenas para a conclusão dos cursos, mas também para deixá-los engajados em diversas outras experiências dentro e fora do contexto universitário. Tais experiências envolvem relações com outras pessoas e situações que podem tornar os discentes ainda mais capacitados profissionalmente e como indivı́duos em um meio social. Atualmente, não há nenhuma plataforma digital destinada exclusivamente aos alunos da UTFPR, que disponibilize a visualização e organização de atividades complementares oferecidas pela universidade ou fora dela. O objetivo deste trabalho é propor e desenvolver um aplicativo móvel para que os alunos da UTFPR - Campus Cornélio Procópio, tenham uma visualização e controle de suas atividades complementares. As principais tecnologias que serão utilizadas neste projeto são ferramenta de prototipação Adobe XD, ferramenta de controle de versionamento Github, ambiente de desenvolvimento Visual Studio Code, framework React-Native, plataforma Firebase, biblioteca react-native-svg-charts, biblioteca de formulários Formik e biblioteca de validação de formulários Yup. A metodologia ágil que será utilizada neste trabalho é a Kanban. Para o gerenciamento das atividades deste projeto, o quadro Kanban utilizado será pela plataforma virtual Trello. Serão criadas cinco colunas para a organização das tarefas, sendo elas: Repository, To do, Doing, Testing e Done. Dentre os artefatos gerados neste projeto encontram-se: requisitos funcionais e não-funcionais, protótipos de média fidelidade, protótiposde alta fidelidade, diagrama de caso de uso, diagramas de atividade, arquitetura do sistema, API Rest, Banco de dados MongoDB e aplicação React Native. O objetivo geral desse trabalho foi desenvolver um aplicativo de celular que auxilie os estudantes da UTFPR campus Cornélio Procópio, pertencentes ao diretório DACOM, a encontrar atividades complementares disponı́veis para serem realizadas. Além disso ele é um aplicativo que auxilia os alunos a terem uma melhor visualização das atividades que já realizaram e manter um controle sob os pontos que já atingiram em cada um dos grupos. Para trabalhos futuros, existem diversos pontos que podem ser melhorados neste projeto. Uma das melhorias futuras que pode ser feita é a de possibilitar que os alunos salvem seus certificados de atividades complementares no próprio aplicativo. Atividades complementares; desenvolvimento de aplicativo; Kanban; React Native; Firebase. DESENVOLVIMENTO DE INTERFACES DE USUÁRIO: ÁREA DE CRÉDITO Este trabalho descreve um projeto que o autor trabalhou como empregado. O projeto consiste em interfaces web de usuários, ou frontend, para um sistema de solicitação de créditoO projeto fez uso de React com Next.js, bem como outras bibliotecas JavaScript. No totaforam criadas mais de 50 páginas web que ajudaram a empresa a emprestar mais de 600 mil reais Desenvolvimento web. Frontend. React."
  },
  {
    "id": 26,
    "name": "José Antonio Gonçalves",
    "email": "jgoncalves@utfpr.edu.br",
    "area": "Desenvolvimento de Software Eng. de Software Desenvolvimento Distribuído de Software Sistema para gerenciamento e monitoramento de bovinos utilizando tecnologia RFID como suporte Este trabalho tem como objetivo propor e desenvolver uma ferramenta para gerenciamento e monitoramento de bovinos, utilizando dados provenientes de leituras de etiquetas Identificação por Rádio Frequência, usadas na marcação de vários objetos, inclusive de animais. Será utilizada a metodologia de desenvolvimento de uma Progressive Web App para a implementação desta ferramenta. Esta metodologia trata-se de uma tecnologia que permite o acesso à aplicativos web por meio de diferentes dispositivos e plataformas, oferecendo o mesmo nível de experiência comparada com aplicativos para dispositivos móveis. O produto final faz o controle centralizado das informações de um rebanho de bovinos por meio de uma ficha de registro. Esta ficha será preenchida com entradas de dados resultantes de visitas à diferentes setores de um sistema de confinamento destes animais. Para o desenvolvimento da proposta serão aplicados os conceitos e boas práticas da Engenharia de Software, desde a Elicitação de Requisitos até a Modelagem dos Dados por meio de diferentes diagramas da Linguagem de Modelagem Unificada e, também, pela adoção de um Modelo de Processo. Gerenciamento de bovinos. Progressive Web App. Radio Frequency Identification. "
  },
  {
    "id": 27,
    "name": "José Augusto Fabri",
    "email": "fabri@utfpr.edu.br",
    "area": "Engenharia de Software Processo de Software"
  },
  {
    "id": 28,
    "name": "Katia Romero Felizardo Scannavino",
    "email": "katiascannavino@utfpr.edu.br",
    "area": "Engenharia de Software Experimental Revisão Sistemática Mapeamento Sistemático"
  },
  {
    "id": 29,
    "name": "Lucas Dias Hiera Sampaio",
    "email": "ldsampaio@utfpr.edu.br",
    "area": "Segurança em redes de computadores, Sistemas modernos de telecomunicações, Rádio Cognitivo, Blockchain e Aplicações, Otimização e Alocação de Recursos em Telecomunicações Script para a Automatização de Testes de Vulnerabilidade em Aplicações Web No mercado atual de desenvolvimento de software, encontra-se cada vez mais a necessidade de entregas constantes e rápidas a fim de se manter a frente no cenário competitivo. Como consequência, a prática de testes de segurança no processo de desenvolvimento acaba se tornando uma tarefa secundária, necessária somente após entregas e realizada por empresas especializadas e, portanto, pode ocasionar a detecção tardia de vulnerabilidades. Dessa forma, a fim de detectar essas vulnerabilidades de segurança ainda no processo de desenvolvimento sem que isso atrase toda a operação, surge a demanda de um fluxo automatizado. O objetivo principal do trabalho foi o desenvolvimento de um script que proporciona aos profissionais da área uma maneira de paralelizar os testes de segurança em aplicações web com suas atividades principais realizadas, além de uma forma mais simples de visualizar os resultados obtidos através de relatórios. Foi realizado uma análise das vulnerabilidades apresentadas pelo OWASP Top Ten, no qual foram escolhidas três categorias: Injection, Vulnerable and Outdated Components e Broken Access Control. O script criado realiza a automatização da execução de diversas ferramentas que auxiliam nos testes de segurança. Esses testes foram divididos em etapas nas quais possuı́am uma ferramenta de auxı́lio, essas etapas são respectivamente: enumeração ou coleta de informações, análise de rede, testes de vulnerabilidade, geração de relatório. Os resultados finais obtidos tiveram uma eficácia variada, as etapas de coleta de informações e geração de relatórios foram bem-sucedidas e proporcionaram resultados esperados, as etapas de análise de rede e vulnerabilidades obtiveram um desempenho baixo devido a limitações de tempo e alcance do script, além de falsos positivos que surgiam na análise de rede. Futuramente, espera-se oferecer uma melhoria no tempo de execução juntamente com o aumento do alcance das análises de vulnerabilidades e eliminação de falsos positivos, também será refeito todo o design do relatório. Script. Segurança. Vulnerabilidades. Web. OWASP. Análise do Desempenho de Algoritmos Classificadores para Detecção de Anomalias em Sistemas de Detecção de Intrusão Com a expansão do uso de serviços em nuvem, a segurança na rede se tornou ponto de foco para o setor de tecnologia. Os ataques aos sistemas empresariais e governamentais através de malwares se intensificaram de forma proporcional ao crescimento do número de usuários que dependem do acesso aos dados e serviços em nuvem. Desta forma, os Sistemas de Detecção de Intrusão baseados em Rede (SDIR) servem como primeira ferramenta de proteção, com algoritmos processando o tráfego em pontos vitais da rede com o intuito de detectar e impedir ações maliciosas. Como técnica complementar aos Sistemas de Detecção por Assinatura, os Sistemas de Detecção por Anomalias analisam o comportamento do tráfego na rede com o objetivo de detectar estes ataques. Uma das formas utilizadas para esta detecção é o uso de algoritmos classificadores para analisar e classificar entre o tráfego normal ou anômalo dos pacotes da rede. O algoritmo de Naı̈ve-Bayes é um classificador utilizado devido a sua simplicidade de implementação. O algoritmo Adaboost, por sua vez, apresenta uma possibilidade de desempenho ao algoritmo. Por fim, a Máquina de Vetores de Suporte (SVM), apresenta um algoritmo de maior complexidade, que servirá como comparativo para os outros algoritmos. Este trabalho irá analisar e comparar o desempenho dos algoritmos classificadores sobre o dataset NB-15 da Universidade de New South Wales de 2015, considerando os principais aspectos para possı́veis implementações em dispositivos reais. Detecção de Anomalias. Algoritmo de Naı̈ve-Bayes. Algoritmo Adaboost. Support Vector Machine. UNSW N15. Análise de presença de dados pessoais em senhas: uma abordagem utilizando redes neurais siamesas O surgimento e popularização da internet a partir do inı́cio do século XXI caracterizou a chamada ”era da informação”, esse fato possibilitou a criação das redes sociais que estimulam a comunicação entre seus adeptos. Entretanto, tal comunicação é baseada no compartilhamento de informações pessoais, que podem ser utilizadas para fins de execução de ataques de engenharia social, uma vez que são informações públicas. Em um primeiro momento, não se tratam de dados sensı́veis, porém podem estar relacionados às credenciais dos usuários. Neste trabalho, é explorada a relação léxica entre trechos de senhas e apresentada uma métrica de avaliação de segurança das mesmas, com base em caracterı́sticas identificadas com o uso de técnicas de aprendizado de máquina. A solução proposta indica a possibilidade de graduação de senhas com base nas em dados pessoais de usuários, e consequentemente, favorece o aumento de segurança das contas dos mesmos. Cibersegurança, aprendizado de máquina, dados pessoais. Aplicação Prática das Habilidades Adquiridas na Graduação em Engenharia de Computação na UTFPR-CP: Um Relatório de Trabalho Profissional Atuando na Vitta Saúde Administradora de Benefı́cios LTDA. O presente trabalho relata a experiência profissional do aluno Matheus Pereira dos Santos na empresa Vitta Saúde Administradora de Benefı́cios LTDA. Aborda a formação da empresa e seu posicionamento no mercado desde 2014, a equipe em que o aluno está inserido e as atividades diárias desempenhadas. Discute os produtos nos quais foram realizadas melhorias, as tarefas realizadas e o nı́vel de dificuldade envolvido. Além disso, são mencionadas as tecnologias utilizadas no desenvolvimento dos projetos. Vitta Saúde. Experiência profissional. Desenvolvimento. Atividades diárias. Back end. RELATÓRIO TÉCNICO - ATUAÇÃO COMO DESENVOLVEDOR NA EMPRESA GAUDIUM Este trabalho relata a perspectiva do aluno como desenvolvedor na empresa Gaudium e os desafios enfrentados para solucionar os problemas propostos. Foram atribuídos dois problemas principais: o primeiro envolveu a adequação do produto Machine com a Lei Geral de Proteção de Dados Pessoais (LGPD), enquanto o segundo teve como objetivo a redução da sobrecarga no banco de dados principal, por meio de alterações na fonte e na forma de consulta dos dados. Os resultados obtidos demonstraram a aplicação efetiva do conhecimento adquirido durante o período de aprendizagem do curso, contribuindo para a resolução dos problemas propostos. A formação do aluno na UTFPR desempenhou um papel fundamental para o desenvolvimento dessas atividades, fornecendo uma base sólida de conhecimentos e habilidades necessárias para enfrentar os desafios técnicos e aplicar soluções eficientes. relatório técnico; lgpd; redis; desenvolvimento. DESENVOLVIMENTO DE UM APLICATIVO PARA ANÚNCIO DE PRESTAÇÃO DE SERVIÇOS A pandemia da COVID-19 trouxe diversos problemas para a sociedade, sendo um deles o aumento do número de desempregados e trabalhadores informais do paı́s. Com o intuito de ajudar essas pessoas, propõe-se a criação do aplicativo ByCOZ, que permite aos trabalhadores informais divulgar seus serviços e aos clientes escolherem aqueles com maior experiência, baseado em avaliações de outros usuários. Este trabalho tem como objetivo mostrar o processo de desenvolvimento da aplicação intitulada ByCOZ como uma forma de auxı́lio para o problema citado e alguns resultados serão utilizados para atender a proposta deste trabalho. aplicativo. Flutter. Firebase. trabalho informal. MEIO DE PAGAMENTO POR NFC PARA CRIPTOMOEDAS As recentes e constantes evoluções tecnológicas no setor financeiro têm transformado a forma como transações financeiras são realizadas. Meios e formas de pagamentos mais práticos, seguros, transparentes e eficientes têm tido mais aderência pelos comerciantes e consumidores. Este trabalho apresenta o desenvolvimento de uma carteira de criptomoedas de custódia própria que permite realizar pagamentos por aproximação sem contato utilizando protocolo Near Field Communication para garantir a facilidade e rapidez nas transações através de tecnologia Blockchain com suporte ao Ethereum Virtual Machine. Além disso, foram realizados testes para avaliar a segurança do aplicativo e a efetividade do processo de pagamento. Os resultados obtidos demonstraram que o aplicativo é uma opção segura e eficiente para realizar transações financeiras, oferecendo uma solução inovadora para o mercado de pagamentos e para o universo das criptomoedas. Blockchain. Criptomoedas. Ethereum. Carteira de criptomoeda por custódia própria. Pagamento por aproximação. JOGOS DIGITAIS: UMA ANÁLISE DO DESENVOLVIMENTO DE UM PROJETO DE LARGA ESCALA Este trabalho visa apresentar o trabalho do aluno Gabriel Augusto Arruda na empresa Oktagon Games, entre dezembro de 2020 e dezembro de 2021. Será exposta sua atuação no estúdio de jogos, ressaltando o fluxo de trabalho da equipe e as funcionalidades desenvolvidas por ele. Durante o perı́odo, ele trabalhou como desenvolvedor de software no projeto Magic: Puzzle Quest, em que esteve responsável por todos aspectos relacionados à manutenção do software frontend do jogo. Por último, o aluno apresenta sua visão de como o curso de Engenharia de Computação contribuiu na sua trajetória profissional. desenvolvimento de jogos. software. game as a service."
  },
  {
    "id": 30,
    "name": "Luciano Tadeu Esteves Pansanato",
    "email": "luciano@utfpr.edu.br",
    "area": "Sistemas de Informação Interação Humano-Computador"
  },
  {
    "id": 31,
    "name": "Natássya Barlate Floro da Silva",
    "email": "natassyasilva@utfpr.edu.br",
    "area": "Redes de Computadores Veículos Autônomos Sistemas Embarcados Análise de comportamento do algoritmo criptográfico AES em sistemas embarcados A segurança em redes de computadores atualmente é uma área que contém muitos desafios, principalmente com a grande quantidade de novos dispositivos e tecnologias que surgem ao passar do tempo. No âmbito da Internet das Coisas com as novas possibilidades de aplicações,a segurança no momento da transmissão de dados nos sistemas embarcados se tornou a experiência. Contudo, as soluções existentes atualmente têm como alvo os principais sistemas convencionais e não sistemas embarcados que contém menos memória e processamento, além de fontes de energia restritas. Neste contexto, este trabalho desenvolveu uma aplicação de troca de mensagens entre sistemas embarcados distintos e entre estes mesmos sistemas e um computador de propósito geral utilizando um canal não seguro, provendo a confidencialidade dos dados transmitidos por meio do algoritmo criptográfico AES utilizando duas bibliotecas: a Relic e a wolfSSL, projetados para sistemas com poucos recursos. Após a implementação da aplicação, análises a respeito dos controles a cerca do tamanho das mensagens, do tamanho das chaves escolhidas para o algoritmo, da arquitetura utilizada e da biblioteca escolhida foram realizadas. De acordo com os resultados obtidos, foi possı́vel verificar que o AES em ambas as bibliotecas é viável para mensagens pequenas, porém para sistemas com menos recursos como o Arduino o processo é consideravelmente mais demorado para mensagens maiores, onde o tempo da criptografia e descriptografia em toda a comunicação neste caso chega a 81% nawolfSSL e 84% para a Relic. Segurança, Sistemas Embarcados, AES, Criptografia Avaliação de experimentos empı́ricos para a estimativa de posição com o método Min-Max e com a aquisição do RSSI em rede IEEE 802.11n O aumento da capacidade de transmissão de dados, somado ao aumento da capacidade de processamento, possibilitaram uma maior automação dos processos manuais. A Internet das Coisas com os sistemas embarcados trouxe uma ampla gama de aplicações viabilizando a comunicação entre os dispositivos. Atrelado ao avanço, a necessidade de localizar-se no espaço com alta precisão é fundamental para que dispositivos monitorem e interajam com o mundo. Este trabalho tem por objetivo realizar experimentos empı́ricos para avaliar o comportamento do erro de estimativa de posição através do método Min-Max em uma variedade de cenários. Neste contexto, a proposta visa estabelecer um sistema de troca de mensagens entre dispositivos embarcados com a finalidade de aquisição de dados para determinar sua distância, utilizando-se da técnica RSSI, e posteriormente a realização do cálculo de estimativa de posição. Foi ob- servado o menor erro no cenário com a maior distância e a maior quantidade de nós âncoras, enquanto, no cenário com a menor distância, não houve influência da quantidade de nós âncoras. Localização. RSSI. Min-Max. IEEE 802.11n. Avaliação da localização baseada no Round-Trip Time of Flight para diferentes modelos de mobilidade em redes Wi-Fi Devido ao atual avanço da tecnologia, evidencia-se a necessidade da utilização dos sistemas de localização para que as inovações como os veı́culos autônomos possam desempenhar seu papel de forma mais eficiente. Em razão disso, existem diferentes métodos para localizar um dispositivo, sendo que o mais comum é o GPS (Global Positioning System). Porém, existem algumas limitações que são notadas principalmente em ambientes complexos ou quando o objeto a ser localizado encontra-se em movimento, para esses casos é necessário que seja utilizada uma forma alternativa. Dessa maneira, destaca-se o método RToF (Round-Trip Time of Flight) que se baseia no tempo de partida e chegada das mensagens para estimar a posição, sendo o intuito deste trabalho a análise de seu desempenho para diferentes modelos de mobilidade conforme são variadas a velocidade do movimento no nó emissor e a quantidade de nós receptores. Essas avaliações foram realizadas por meio do simulador OMNeT++ com a criação da rede WLAN (Wireless Local Area Network) e configuração dos diferentes tipos de cenários que foram utilizados para realização dos experimentos. Além disso, foi utilizado a técnica Maximum Likelihood Estimation (MLE) para o cálculo da trilateração, de forma a obter uma estimativa da posição do nó emissor. Portanto, os resultados da avaliação do algoritmo RToF em conjunto com o MLE em ambiente de simulação demonstram que o tipo de movimento que o nó emissor realiza não interfere na estimativa de posição, diferentemente da velocidade e quantidade de nós que impactaram nitidamente na estimativa de posição do nó emissor. Localização, RToF, Mobilidade. Sistema automático para o ajuste de métodos de criptografia de acordo com a disponibilização de recursos para sistemas embarcados A segurança de redes de computadores é uma das áreas tecnológicas com grandes desafios. Com o crescente número de projetos de Internet das Coisas é fundamental proporcionar se- gurança a seus dispositivos. Todavia, um dos obstáculos dos desenvolvedores, engenheiros e aventureiros na tecnologia é a limitação do hardware. Nesse contexto, este trabalho buscou desenvolver um sistema de negociação automática de algoritmos criptográficos simétricos que dependa da verificação dos recursos disponı́veis como a memória principal, o uso do processador e o nı́vel disponı́vel de energia armazenada no lado do Cliente. Assim, foram utilizados os algoritmos criptográficos AES e Chacha20. Esses tipos de algoritmos são recomendados para uma comunicação entre dispositivos, pois são leves, rápidos e utilizam poucos recursos em sua execução, caracterı́sticas úteis em um sistema embarcado, de acordo com a literatura. Essa mudança automática foi definida com o objetivo de obter uma maior performance de seu hardware/software e uma comunicação de ponto a ponto segura, proporcionando assim a confidencialidade na camada de aplicação. Nos experimentos a plataforma Orange Pi One apresentou uma melhor performance com as métricas selecionadas, quando comparado ao computador de uso geral com a troca automática de criptografia. Também foi possı́vel observar uma maior velocidade empenhada pelo algoritmo criptográfico Chacha20 com uma velocidade de execução superior aos demais aqui analisados. Contudo, a redução do consumo de energia ainda não foi alcançada, mas as entregas das mensagens de forma que possa proporcionar a confidencialidade dela foi realizada com sucesso. Criptografia, Sistema Embarcado, Protocolo de Negociação Monitoramento do consumo de energia com um sistema IoT para geração de relatórios A Internet das Coisas, ou do inglês Internet of Things (IoT), pode ser explicada como sendo ligação entre dispositivos eletrônicos, sensores ou quaisquer outros dispositivos que possuem conectividade com a rede. Com o crescimento do estudo do IoT, alguns modelos denominados casas inteligentes começaram a surgir. Esse termo é utilizado para descrever o controle de equipamentos de forma mais automatizada, tendo o mı́nimo possı́vel de interação humana. Muitos desses equipamentos geram informações, que são possı́veis de ser guardadas e gerarem relatórios, e sua análise pode gerar uma economia de energia, por exemplo. Esse trabalho apresenta um sistema capaz de realizar medições de corrente elétrica em tempo real, de maneira não invasiva, podendo também analisar todo o histórico de medições dos disposições por meio de gráficos. Para a comprovação do funcionamento do sistema, o trabalho apresenta experimentos com diferentes aparelhos elétricos com a medição de suas correntes elétricas durante seu uso, permitindo a validação dos resultados obtidos pela comparação com seus valores teóricos. Foram realizados três experimentos para validação do sistema, tendo resultados com boa precisão, apenas com um pouco de ruı́do em baixas correntes. Monitoramento de Energia, Casas inteligentes, Internet das Coisas, IoT"
  },
  {
    "id": 32,
    "name": "Paulo Augusto Nardi",
    "email": "paulonardi@utfpr.edu.br",
    "area": "Desenvolvimento de Software Jogos Teste de Software Banco de Dados Gamificação da intervenção Neuropsicopedagógica com o uso de Eye Tracking Este Trabalho de Conclusão de Curso tem como objetivo criar uma ferramenta de auxilio ao profissional da área de Neuropsicopedagogia, cuja função será viabilizar a automação da aplicação do Teste de Atenção por Cancelamento e Teste de Trilhas com o uso de Eye Tracking. A ferramenta será composta de um jogo desenvolvido na plataforma Unity Hub e de um rastreador ocular utilizando as bibliotecas OpenCV e Dlib. Neuropsicopedagogia. Teste de Atenção por Cancelamento. Teste de Trilhas.Eye Tracking. PROgamming: DESENVOLVIMENTO DE JOGO 2D PARA AUXILIAR NA LÓGICA DE PROGRAMAÇÃO Nos últimos anos, o mercado de desenvolvimento de software é o serviço que mais cresce na área da Tecnologia da Informação, ocasionando no aumento da procura por profissionais disponı́veis para trabalhar, seja na parte de segurança, infraestrutura ou desenvolvimento. Contudo a demanda por técnicos em informática é maior do que a quantidade de profissionais dispostos a trabalhar no setor. Com o intuito de contribuir com a redução da quantidade de acadêmicos que desistem de estudar na área de TI, por se sentirem desmotivados ou frustrados ao desenvolver um código, o trabalho a seguir propõe auxiliar e incentivar aprendizes iniciando seus estudos na programação por meio de um jogo educacional, abordando a lógica e os fundamentos básicos da programação. Serious Game. Jogo educacional. Lógica de programação. Fundamentos básicos da programação. Jogo 2D. Um Relato de Experiência sobre Mapas Procedurais em Unity Geração Procedural de Conteúdo (PCG) é uma abordagem onde a responsabilidade, total ou parcial, da criação do conteúdo fica sob responsabilidade do computador. É usada desde a década de 1980 na indústria de jogos como meio de tornar o jogo mais imprevisível e aumentar sua rejogabilidade. Essa abordagem vem sendo melhorada e atualmente quase todos os jogos utilizam de PCG em algum aspecto. Devido a demanda por este tipo de conteúdo foram desenvolvidas ferramentas que utilizam da PCG para criar tipos específicos de conteúdo. O objetivo deste trabalho é realizado uma análise de três ferramentas selecionadas: Tilesetter, IntelliMap e Forever, através de um relato de experiência ao desenvolver jogos no gênero Endless Runner e analisar quais os benefícios e impedimentos que as empresas e desenvolvedores independentes podem encontrar ao utilizar estas ferramentas. Geração Procedural de Conteúdo, Rejogabilidade, Relato de Experiência, Ferramentas, Tilesetter, InteliMap, Forever."
  },
  {
    "id": 33,
    "name": "Rodrigo Henrique Cunha Palácios",
    "email": "rodrigopalacios@utfpr.edu.br",
    "area": "IoT Inteligência Artificial Visão Computacional Projetos de Hardware/Software Processamento Digital de Sinais Robótica Business Intelligence Como Apoio As Rotinas De Fiscalização Do Crea-Pr Buscar e obter informações sobre pessoas jurídicas é relevante devido a aplicabilidade do uso desses dados em diversos setores. Grandes bases de dados demandam poder de processamento e habilidades técnicas elevadas para otimização de buscas e retirada de conhecimento. O presente trabalho propõe unir fundamentação teórica com aplicabilidade prática para produção de uma solução de automatização de coleta, tratamento e disponibilização de dados da base pública de CNPJ. Após o processamento de dados, espera-se obter um dashboard de Business Intelligence que contribua para os processos de fiscalização feitos pelo CREA-PR. Inteligência de Negócios. CREA-PR. Análise de Dados "
  },
  {
    "id": 34,
    "name": "Rogério Santos Pozza",
    "email": "pozza@utfpr.edu.br",
    "area": "Redes Corporais, Redes de Sensores sem Fio, Redes Ad Hoc, IoT Sistemas Distribuídos Desenvolvimento de Software (arduino, raspberry, web) SIMULAÇÃO DE REDES IOT COM TÉCNICAS DE SEGURANÇA COM PACKET TRACER O estudo da Internet das Coisas (IoT) tem obtido mais relevância devido às suas aplicações, utilizando dados obtidos por meio de sensores para diversas finalidades que podem contribuir com o trabalho de seus usuários, mas também ocasionar preocupação com relação à segurança dessas informações e do próprio ambiente no qual estão dispostos. Este trabalho tem como objetivo realizar simulações utilizando o Cisco Packet Tracer para mostrar possı́veis aplicações de dispositivos IoT, como elas podem ser implementadas e como utilizar o protocolo WPA2 e o firewall Cisco ASA 5505 para proteção da rede e dos dispositivos. Foi verificada a possibilidade de adaptar tais técnicas de segurança a uma rede IoT mantendo o funcionamento esperado dos dispositivos no ambiente de simulação. Packet Tracer. Simulação. IoT. WPA2. Firewall. RELATÓRIO TÉCNICO - ATUAÇÃO COMO DESENVOLVEDORA NA EMPRESA FUNCIONAL HEALTH TECH Este trabalho acadêmico aborda a aplicação dos conceitos teóricos aprendidos sobre diversos ramos do curso de Engenharia de Software em um ambiente real de trabalho, tendo uma abordagem prática sobre a atuação em projetos de linguagens como o ASP.NET e NestJS. Todo esse processo contribuiu de forma significativa para a empresa ao melhorar o fluxo de implantação de novos clientes, possibilitando a integração entre todos os canais de atuação desses novos implantados. Desenvolvimento de software. Comunicação efetiva. Formação pessoal e profissional."
  },
  {
    "id": 35,
    "name": "Rosangela de Fátima Pereira Marquesone",
    "email": "romarquesone@utfpr.edu.br",
    "area": "Big Data / Analytics Ciência de dados Processamento distribuído Tecnologias digitais aplicadas à economia circular BLUELAB - DESENVOLVIMENTO WEB O presente estudo teve como foco o fluxo de trabalho dentro da empresa Bluelab, uma especialista no desenvolvimento de soluções conversacionais por meio de robôs (bots). A pesquisa abrangeu todas as etapas e processos, desde a concepção da ideia até a entrega do produto final. Foi realizada uma exploração detalhada dos diferentes departamentos da empresa, destacando as responsabilidades de cada um. O foco principal foi na área de tecnologia e desenvolvimento, com ênfase na segurança e armazenamento de dados, gestão da infraestrutura em nuvem, monitoramento do sistema e implementação de uma plataforma para visualização em tempo real das estatı́sticas do robô. O trabalho ressalta a importância desses aspectos para garantir a eficácia e o sucesso das soluções conversacionais oferecidas pela empresa. Bluelab. Soluções conversacionais. Segurança. ANÁLISES DE ARQUITETURAS DE DADOS PARA PROJETOS DE BIG DATA Com o crescimento do fluxo de dados no mundo, as tecnologias que giram entorno de Big Data se tem um desejo por inovação crescendo. Tendo em vista o contexto atual vem a necessidade de entender sobre as singularidades de cada arquitetura de Big Data. Para esse fim, nesse trabalho é realizada uma fundamentação teórica e análise de duas arquiteturas de Big Data que têm se destacado nos últimos anos: Data Lake e Data Mesh. O projeto traz a proposta de entender a singularidade dessas arquiteturas, utilizando a metodologia exploratória, desenvolvendo um ambiente de Big Data com dados sintéticos para cada arquitetura. O estudo permitiu entender como as estruturas e sua maneira de consumo de dados das arquiteturas de Data Lake e Data Mesh são. Big Data, Data Lake, Data Mesh, Arquitetura."
  },
  {
    "id": 36,
    "name": "Silvio Ricardo Rodrigues Sanches",
    "email": "silviosanches@utfpr.edu.br",
    "area": "Visão Computacional Realidade Aumentada Ambientes Virtuais de Aprendizagem no contexto EaD no Brasil: Comparativo das principais ferramentas O presente trabalho tem como objetivo comparar funcionalidades das principais ferramentas adotadas para facilitar o processo de aprendizagem na educação a distância e investigar como as principais plataformas de ambiente virtual de aprendizagem utilizadas no Brasil se relacionam com os princı́pios da pedagogia. Busca-se mapear as contribuições dessas ferramentas na educação a distância e como promovem a efetiva inovação educacional. Para atingir esses objetivos, foram realizados o mapeamento das funcionalidades e a análise das contribuições das ferramentas de ambiente virtual no processo de ensino-aprendizagem. Educação a distância. Ambientes virtuais de aprendizagem. Comparativo."
  },
  {
    "id": 37,
    "name": "Vanderley Flor da Rosa",
    "email": "vanderley@utfpr.edu.br",
    "area": "Engenharia de Software"
  },
  {
    "id": 38,
    "name": "Willian Massami Watanabe",
    "email": "wwatanabe@utfpr.edu.br",
    "area": "Engenharia de Software Desenvolvimento Web Interação Humano-Computador"
  }
]